[
  {
    "question_text": "Which is the most common cause of maternal death in the puerperium?",
    "option_a": "Thromboembolism",
    "option_b": "Sepsis",
    "option_c": "Postpartum hemorrhage",
    "option_d": "Eclampsia",
    "correct_answer": "B",
    "explanation": "Puerperal sepsis remains a leading cause of maternal mortality during the postpartum period, especially in low-resource settings.",
    "additional": "Exam pearl: Nurses must emphasize aseptic techniques during delivery, early detection of fever, foul lochia, or abdominal pain, and prompt antibiotic therapy."
  },
  {
    "question_text": "Which is the most common cause of maternal collapse immediately after delivery?",
    "option_a": "Amniotic fluid embolism",
    "option_b": "Pulmonary embolism",
    "option_c": "Hypovolemic shock due to PPH",
    "option_d": "Eclampsia",
    "correct_answer": "C",
    "explanation": "Massive postpartum hemorrhage leading to hypovolemic shock is the most frequent cause of maternal collapse soon after delivery.",
    "additional": "Exam pearl: Rapid recognition and immediate action with uterotonics, IV fluids, and blood transfusion are lifesaving."
  },
  {
    "question_text": "Which is the main risk factor for placenta previa?",
    "option_a": "Multiparity",
    "option_b": "Advanced maternal age",
    "option_c": "Previous cesarean section",
    "option_d": "Multiple pregnancy",
    "correct_answer": "C",
    "explanation": "A previous cesarean scar predisposes to abnormal placental implantation, including placenta previa and accreta.",
    "additional": "Exam pearl: Nurses should anticipate bleeding risk and prepare women with prior CS for careful ultrasound follow-up."
  },
  {
    "question_text": "Which is the commonest cause of neonatal convulsions on the first day of life?",
    "option_a": "Hypocalcemia",
    "option_b": "Hypoglycemia",
    "option_c": "Birth asphyxia",
    "option_d": "Sepsis",
    "correct_answer": "C",
    "explanation": "Birth asphyxia is the leading cause of neonatal seizures within the first 24 hours. Hypoglycemia and sepsis occur later.",
    "additional": "Exam pearl: Nurses in NBU must monitor for twitching, jerky movements, and apnea in asphyxiated babies and initiate supportive care quickly."
  },
  {
    "question_text": "Which is the most specific sign of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Breast changes",
    "option_c": "Quickening",
    "option_d": "Detection of fetal heart sounds",
    "correct_answer": "D",
    "explanation": "Fetal heart sounds heard on Doppler or fetoscope are a confirmatory sign of pregnancy. Other signs are presumptive or probable.",
    "additional": "Exam pearl: Nurses must differentiate between presumptive, probable, and positive signs of pregnancy in exams and practice."
  },
  {
    "question_text": "Which is the most important complication of multiple pregnancy?",
    "option_a": "Preterm labor",
    "option_b": "Malpresentation",
    "option_c": "PPH",
    "option_d": "Hypertensive disorders",
    "correct_answer": "A",
    "explanation": "Preterm labor is the most frequent complication of multiple gestation, although malpresentation and PPH are also common.",
    "additional": "Exam pearl: Nurses should counsel mothers with multiple gestations on increased ANC visits, nutrition, and warning signs of preterm labor."
  },
  {
    "question_text": "Which is the most common site for fertilization?",
    "option_a": "Infundibulum",
    "option_b": "Ampulla of fallopian tube",
    "option_c": "Isthmus",
    "option_d": "Uterine cavity",
    "correct_answer": "B",
    "explanation": "The ampulla of the fallopian tube is the usual site of fertilization due to its wide lumen and proximity to the ovary.",
    "additional": "Exam pearl: Knowledge of fertilization sites helps explain ectopic pregnancy risks and embryology basics."
  },
  {
    "question_text": "Which is the best indicator of true conjugate adequacy in pelvis assessment?",
    "option_a": "Diagonal conjugate",
    "option_b": "Obstetric conjugate",
    "option_c": "External conjugate",
    "option_d": "Interspinous diameter",
    "correct_answer": "B",
    "explanation": "The obstetric conjugate directly represents the shortest AP diameter through which the fetal head must pass, making it the best indicator of pelvic adequacy.",
    "additional": "Exam pearl: Clinically, diagonal conjugate is measured and obstetric conjugate is estimated by subtracting ~1.5–2 cm."
  },
  {
    "question_text": "Which is the most common cause of third-trimester bleeding?",
    "option_a": "Abruptio placentae",
    "option_b": "Placenta previa",
    "option_c": "Uterine rupture",
    "option_d": "Cervical polyp",
    "correct_answer": "B",
    "explanation": "Placenta previa is the leading cause of bleeding in the third trimester, classically painless and bright red.",
    "additional": "Exam pearl: Nurses must avoid vaginal exams in suspected placenta previa and prepare for cesarean delivery if bleeding persists."
  },
  {
    "question_text": "Which hormone is essential for maintenance of early pregnancy?",
    "option_a": "Estrogen",
    "option_b": "Progesterone",
    "option_c": "Prolactin",
    "option_d": "Oxytocin",
    "correct_answer": "B",
    "explanation": "Progesterone maintains uterine quiescence and supports the endometrium in early pregnancy until the placenta takes over hormone production.",
    "additional": "Exam pearl: Low progesterone may contribute to early miscarriage; supplementation is sometimes used in threatened abortion."
  },
  {
    "question_text": "Which is the main function of relaxin during pregnancy?",
    "option_a": "Increase milk production",
    "option_b": "Maintain uterine quiescence",
    "option_c": "Soften pelvic ligaments",
    "option_d": "Stimulate uterine contractions",
    "correct_answer": "C",
    "explanation": "Relaxin softens pelvic ligaments and the cervix to facilitate childbirth. Progesterone maintains quiescence, not relaxin.",
    "additional": "Exam pearl: Relaxin contributes to pelvic girdle pain and increased joint laxity during pregnancy."
  },
  {
    "question_text": "Which of the following is a contraindication to external cephalic version (ECV)?",
    "option_a": "Multiple pregnancy",
    "option_b": "Polyhydramnios",
    "option_c": "Breech presentation at 37 weeks",
    "option_d": "History of preterm labor",
    "correct_answer": "A",
    "explanation": "Multiple pregnancy is an absolute contraindication to ECV due to the risk of complications. Polyhydramnios may increase success rates, not contraindicate it.",
    "additional": "Exam pearl: ECV is typically done at 36–37 weeks under ultrasound and tocolysis, if no contraindications exist."
  },
  {
    "question_text": "Which of the following is the most common cause of early pregnancy loss?",
    "option_a": "Uterine anomalies",
    "option_b": "Chromosomal abnormalities",
    "option_c": "Infections",
    "option_d": "Endocrine disorders",
    "correct_answer": "B",
    "explanation": "Chromosomal abnormalities, especially trisomies, are the most frequent cause of spontaneous abortion in the first trimester.",
    "additional": "Exam pearl: Nurses should provide emotional support and reassurance that most women have successful pregnancies afterward."
  },
  {
    "question_text": "Which is the most important complication of placenta accreta?",
    "option_a": "Severe hemorrhage",
    "option_b": "Preterm labor",
    "option_c": "IUGR",
    "option_d": "Uterine rupture",
    "correct_answer": "A",
    "explanation": "Placenta accreta causes life-threatening hemorrhage at delivery because the placenta fails to separate normally.",
    "additional": "Exam pearl: Nurses prepare for surgical interventions like hysterectomy and massive transfusion when accreta is suspected."
  },
  {
    "question_text": "Which is the best method of monitoring progress of labor?",
    "option_a": "Uterine contractions",
    "option_b": "Fetal descent",
    "option_c": "Partograph",
    "option_d": "Cervical effacement",
    "correct_answer": "C",
    "explanation": "The partograph is the gold standard tool for monitoring labor progress, combining cervical dilation, descent, and contraction patterns.",
    "additional": "Exam pearl: Nurses must master plotting on the partograph to detect obstructed labor early and initiate timely referral."
  },
  {
    "question_text": "Which is the most common cause of puerperal pyrexia?",
    "option_a": "Urinary tract infection",
    "option_b": "Wound infection",
    "option_c": "Endometritis",
    "option_d": "Mastitis",
    "correct_answer": "C",
    "explanation": "Endometritis is the leading cause of puerperal fever, particularly following prolonged labor or cesarean delivery.",
    "additional": "Exam pearl: Nurses should monitor for fever, foul-smelling lochia, abdominal tenderness, and initiate antibiotics promptly."
  },
  {
    "question_text": "Which is the first step in neonatal resuscitation?",
    "option_a": "Suctioning the airway",
    "option_b": "Drying and stimulating the baby",
    "option_c": "Providing positive pressure ventilation",
    "option_d": "Cutting the cord",
    "correct_answer": "B",
    "explanation": "The initial step is to dry and stimulate the baby to initiate spontaneous breathing. Suctioning is only done if airway obstruction is suspected.",
    "additional": "Exam pearl: Nurses should follow the NRP algorithm: warm, dry, stimulate, clear airway if needed, then assess breathing and heart rate."
  },
  {
    "question_text": "Which is the most common cause of maternal death during pregnancy worldwide?",
    "option_a": "Sepsis",
    "option_b": "Postpartum hemorrhage",
    "option_c": "Hypertensive disorders",
    "option_d": "Obstructed labor",
    "correct_answer": "B",
    "explanation": "Postpartum hemorrhage remains the leading cause of maternal mortality globally, especially in low-income countries.",
    "additional": "Exam pearl: Nurses play a vital role in prevention of PPH by active management of the third stage of labor, rapid detection of atony, and emergency preparedness."
  },
  {
    "question_text": "Which is the most common cause of early puerperal psychosis?",
    "option_a": "Bipolar disorder",
    "option_b": "Schizophrenia",
    "option_c": "Severe depression",
    "option_d": "Personality disorder",
    "correct_answer": "A",
    "explanation": "Bipolar disorder is the psychiatric condition most strongly associated with puerperal psychosis, often manifesting soon after delivery.",
    "additional": "Exam pearl: Nurses must urgently recognize psychosis to prevent harm to mother and infant, ensuring rapid psychiatric referral and family support."
  },
  {
    "question_text": "Which is the most common cause of maternal mortality in eclampsia?",
    "option_a": "Pulmonary edema",
    "option_b": "Renal failure",
    "option_c": "Cerebral hemorrhage",
    "option_d": "Cardiac arrest",
    "correct_answer": "C",
    "explanation": "Cerebral hemorrhage due to uncontrolled hypertension is the primary cause of maternal death in eclampsia.",
    "additional": "Exam pearl: Nurses must monitor blood pressure vigilantly, administer antihypertensives and MgSO₄, and act quickly at signs of neurological deterioration."
  },
  {
    "question_text": "Which is the safest method of sterilization in men?",
    "option_a": "Vasectomy",
    "option_b": "Condoms",
    "option_c": "Withdrawal method",
    "option_d": "Hormonal therapy",
    "correct_answer": "A",
    "explanation": "Vasectomy is a safe, effective, and permanent method of male sterilization. Condoms and withdrawal are temporary, while hormonal methods are experimental.",
    "additional": "Exam pearl: Nurses provide counseling on permanency, simplicity of procedure, and reassurance that sexual function remains unaffected."
  },
  {
    "question_text": "Which is the earliest sign of pregnancy on physical examination?",
    "option_a": "Breast tenderness",
    "option_b": "Amenorrhea",
    "option_c": "Chadwick’s sign",
    "option_d": "Quickening",
    "correct_answer": "C",
    "explanation": "Chadwick’s sign (bluish discoloration of the cervix and vagina) can appear as early as 6–8 weeks, making it the earliest clinical sign.",
    "additional": "Exam pearl: Presumptive signs include amenorrhea and nausea; probable signs include Chadwick’s and Hegar’s signs; positive signs include FHR and fetal movements felt by examiner."
  },
  {
    "question_text": "Which is the main risk factor for shoulder dystocia?",
    "option_a": "Multiple pregnancy",
    "option_b": "Fetal macrosomia",
    "option_c": "Polyhydramnios",
    "option_d": "Preterm labor",
    "correct_answer": "B",
    "explanation": "Fetal macrosomia is the strongest risk factor for shoulder dystocia, although it can occur unpredictably in normal-weight infants too.",
    "additional": "Exam pearl: Nurses must be prepared for maneuvers like McRoberts and suprapubic pressure during delivery when macrosomia is suspected."
  },
  {
    "question_text": "Which is the most important complication of polyhydramnios?",
    "option_a": "Cord prolapse",
    "option_b": "Postpartum hemorrhage",
    "option_c": "Preterm labor",
    "option_d": "All of the above",
    "correct_answer": "D",
    "explanation": "Polyhydramnios predisposes to cord prolapse, preterm labor, and uterine atony causing PPH, making all listed complications important.",
    "additional": "Exam pearl: Nurses should closely monitor fluid levels, maternal discomfort, and labor complications in polyhydramnios cases."
  },
  {
    "question_text": "Which is the best method to diagnose ectopic pregnancy early?",
    "option_a": "Urine pregnancy test",
    "option_b": "Culdocentesis",
    "option_c": "Transvaginal ultrasound",
    "option_d": "Serial hemoglobin estimation",
    "correct_answer": "C",
    "explanation": "Transvaginal ultrasound is the most reliable and earliest method to diagnose ectopic pregnancy by detecting an empty uterus and adnexal mass.",
    "additional": "Exam pearl: Nurses should suspect ectopic pregnancy in any woman of reproductive age with abdominal pain and positive pregnancy test."
  },
  {
    "question_text": "Which is the best method of preventing mother-to-child transmission of HIV?",
    "option_a": "Exclusive breastfeeding only",
    "option_b": "Cesarean delivery",
    "option_c": "Maternal antiretroviral therapy",
    "option_d": "Infant prophylaxis only",
    "correct_answer": "C",
    "explanation": "Maternal antiretroviral therapy is the most effective intervention to prevent vertical transmission of HIV.",
    "additional": "Exam pearl: Nurses must ensure adherence to ART, encourage safe infant feeding choices, and provide ongoing counseling."
  },
  {
    "question_text": "Which hormone is mainly responsible for uterine contractions during labor?",
    "option_a": "Progesterone",
    "option_b": "Oxytocin",
    "option_c": "Estrogen",
    "option_d": "Prolactin",
    "correct_answer": "B",
    "explanation": "Oxytocin stimulates uterine muscle contractions essential for labor. Progesterone relaxes the uterus, while estrogen primes it.",
    "additional": "Exam pearl: Nurses administer synthetic oxytocin during induction and augmentation of labor and monitor for hyperstimulation."
  },
  {
    "question_text": "Which complication is most associated with premature rupture of membranes (PROM)?",
    "option_a": "Puerperal sepsis",
    "option_b": "Chorioamnionitis",
    "option_c": "Cord prolapse",
    "option_d": "Polyhydramnios",
    "correct_answer": "B",
    "explanation": "Chorioamnionitis is the most important complication of PROM due to ascending infection once membranes are ruptured.",
    "additional": "Exam pearl: Nurses should monitor temperature, foul liquor, and maternal tachycardia, and prepare for timely delivery if infection sets in."
  },
  {
    "question_text": "Which is the most common cause of maternal mortality after cesarean section?",
    "option_a": "Sepsis",
    "option_b": "Thromboembolism",
    "option_c": "Hemorrhage",
    "option_d": "Anesthetic complications",
    "correct_answer": "C",
    "explanation": "Hemorrhage is the most frequent direct cause of maternal death after cesarean delivery.",
    "additional": "Exam pearl: Nurses must monitor post-op bleeding closely, check vitals frequently, and prepare for transfusion if needed."
  },
  {
    "question_text": "Which vitamin deficiency causes megaloblastic anemia in pregnancy?",
    "option_a": "Vitamin A",
    "option_b": "Folic acid",
    "option_c": "Vitamin C",
    "option_d": "Vitamin D",
    "correct_answer": "B",
    "explanation": "Folic acid deficiency is the leading cause of megaloblastic anemia in pregnancy due to increased maternal and fetal demand.",
    "additional": "Exam pearl: Nurses should educate on folate-rich foods and routine supplementation during ANC."
  },
  {
    "question_text": "Which is the most common cause of neonatal death after the first week of life?",
    "option_a": "Neonatal sepsis",
    "option_b": "Prematurity",
    "option_c": "Birth asphyxia",
    "option_d": "Congenital malformations",
    "correct_answer": "A",
    "explanation": "After the first week, neonatal sepsis overtakes prematurity and asphyxia as the main cause of neonatal mortality.",
    "additional": "Exam pearl: Nurses must practice asepsis, promote exclusive breastfeeding, and recognize early danger signs in neonates."
  },
  {
    "question_text": "Which is the best contraceptive method for a woman with sickle cell disease?",
    "option_a": "Combined oral contraceptives",
    "option_b": "Progestin-only methods",
    "option_c": "Copper IUD",
    "option_d": "Barrier methods",
    "correct_answer": "B",
    "explanation": "Progestin-only methods are recommended for women with sickle cell disease as they are safe and may reduce crisis frequency.",
    "additional": "Exam pearl: Nurses should avoid estrogen-containing methods in sickle cell patients due to thromboembolic risk."
  },
  {
    "question_text": "Which is the commonest cause of maternal mortality during the puerperium?",
    "option_a": "Sepsis",
    "option_b": "Postpartum hemorrhage",
    "option_c": "Eclampsia",
    "option_d": "Thromboembolism",
    "correct_answer": "A",
    "explanation": "Sepsis, particularly puerperal sepsis, is a major contributor to maternal deaths in the postpartum period. It results from infections of the genital tract, most often endometritis, and can progress rapidly to septicemia if not treated promptly. Early recognition and antibiotic therapy are vital.",
    "additional": "Exam pearl: Puerperal sepsis is preventable with clean delivery practices, hand hygiene, and proper wound care. Nurses should monitor for fever, foul-smelling lochia, abdominal tenderness, and tachycardia. WHO defines puerperal sepsis as infection of the genital tract between labor and 42 days postpartum, with two or more of the following: pelvic pain, fever ≥38°C, abnormal lochia, or delayed uterine involution. Prediction tip: NCK exams often test on definitions, early signs, and nursing prevention measures of puerperal sepsis."
  },
  {
    "question_text": "Which is the safest contraceptive for a lactating mother immediately postpartum?",
    "option_a": "Combined oral contraceptive pills",
    "option_b": "Progestin-only methods",
    "option_c": "Copper IUD",
    "option_d": "Emergency contraception",
    "correct_answer": "B",
    "explanation": "Progestin-only contraceptives (mini-pill, implant, injectables) are safe in breastfeeding because they do not affect milk production. Combined estrogen-progestin pills can reduce milk supply if introduced too early.",
    "additional": "Exam pearl: WHO recommends starting progestin-only methods immediately after delivery, while combined pills should be delayed for at least 6 months if exclusively breastfeeding. Nurses should educate mothers on the lactational amenorrhea method (LAM), which is effective up to 6 months postpartum if exclusive breastfeeding is practiced. NCK exams commonly test timing of contraceptive initiation and safe methods for breastfeeding women."
  },
  {
    "question_text": "Which is the most common cause of neonatal death globally?",
    "option_a": "Prematurity and its complications",
    "option_b": "Birth asphyxia",
    "option_c": "Sepsis",
    "option_d": "Congenital anomalies",
    "correct_answer": "A",
    "explanation": "Prematurity and its complications, particularly respiratory distress syndrome and infections, account for the majority of neonatal deaths worldwide. The earlier the gestational age, the higher the risk of morbidity and mortality.",
    "additional": "Exam pearl: Preterm infants face challenges like hypothermia, hypoglycemia, sepsis, and respiratory distress due to immature lungs. Nursing care includes thermal protection, kangaroo mother care, oxygen therapy, and infection prevention. In exams, prematurity often appears linked to survival strategies such as antenatal steroids, surfactant therapy, and early initiation of breastfeeding."
  },
  {
    "question_text": "Which of the following is the most important complication of abruptio placentae?",
    "option_a": "Postpartum hemorrhage",
    "option_b": "Disseminated intravascular coagulation (DIC)",
    "option_c": "Intrauterine growth restriction",
    "option_d": "Intrauterine death",
    "correct_answer": "B",
    "explanation": "DIC is a life-threatening complication of abruptio placentae, triggered by release of thromboplastin from the retroplacental clot. This leads to consumption of clotting factors, uncontrolled bleeding, and shock.",
    "additional": "Exam pearl: Clinical features of abruptio placentae include painful vaginal bleeding, uterine tenderness, and fetal distress. Nurses should anticipate hypovolemic shock and DIC, monitor vital signs and urine output, and prepare for blood transfusion and expedited delivery. In NCK exams, focus on recognizing the triad (pain, bleeding, tense uterus) and knowing DIC as the most feared complication."
  },
  {
    "question_text": "Which is the most specific sign of fetal distress?",
    "option_a": "Meconium-stained liquor",
    "option_b": "Reduced fetal movements",
    "option_c": "Persistent late decelerations on CTG",
    "option_d": "Bradycardia below 110 bpm",
    "correct_answer": "C",
    "explanation": "Persistent late decelerations on cardiotocography (CTG) are the most specific sign of fetal hypoxia and distress, reflecting uteroplacental insufficiency. Bradycardia and reduced movements are supportive but less specific.",
    "additional": "Exam pearl: Nurses should differentiate early (benign), variable (cord compression), and late (placental insufficiency) decelerations. Management includes maternal repositioning, oxygen, IV fluids, discontinuing oxytocin, and preparing for urgent delivery. Exam questions often ask which CTG pattern is most dangerous—late decelerations is the answer."
  },
  {
    "question_text": "Which is the leading cause of maternal mortality due to hypertensive disorders of pregnancy?",
    "option_a": "Cerebral hemorrhage",
    "option_b": "Pulmonary edema",
    "option_c": "Renal failure",
    "option_d": "Eclampsia seizures",
    "correct_answer": "A",
    "explanation": "Cerebral hemorrhage, resulting from uncontrolled severe hypertension, is the leading cause of maternal death in pre-eclampsia and eclampsia.",
    "additional": "Exam pearl: Nursing interventions include strict BP monitoring, antihypertensive therapy (hydralazine, labetalol), seizure prophylaxis with MgSO₄, and ensuring delivery once mother is stable. Prediction: Exams often test the link between poorly controlled hypertension and cerebral hemorrhage as the most fatal complication."
  },
  {
    "question_text": "Which is the most effective method to prevent neonatal tetanus?",
    "option_a": "Clean cord care",
    "option_b": "Neonatal antibiotics",
    "option_c": "Maternal tetanus toxoid immunization",
    "option_d": "Immediate breastfeeding",
    "correct_answer": "C",
    "explanation": "Maternal immunization with tetanus toxoid during pregnancy provides antibodies that cross the placenta, protecting the newborn against neonatal tetanus.",
    "additional": "Exam pearl: Nurses should ensure that pregnant women receive at least 2 doses of tetanus toxoid. Clean cord care complements but does not replace immunization. In exams, the correct prevention method is almost always maternal immunization, not neonatal antibiotics."
  },
  {
    "question_text": "Which is the commonest cause of breech presentation?",
    "option_a": "Prematurity",
    "option_b": "Multiple pregnancy",
    "option_c": "Placenta previa",
    "option_d": "Uterine anomalies",
    "correct_answer": "A",
    "explanation": "Prematurity is the most frequent cause of breech presentation because the fetus has not yet assumed the cephalic position.",
    "additional": "Exam pearl: Other causes include uterine anomalies, multiple pregnancy, and polyhydramnios. Breech increases risk of cord prolapse, birth trauma, and asphyxia. Nurses must prepare for assisted breech delivery or cesarean section depending on circumstances. In exams, prematurity is the most commonly tested cause."
  },
  {
    "question_text": "Which is the earliest detectable sign of pregnancy on ultrasound?",
    "option_a": "Gestational sac",
    "option_b": "Yolk sac",
    "option_c": "Fetal heartbeat",
    "option_d": "Fetal pole",
    "correct_answer": "A",
    "explanation": "The gestational sac is the first structure seen on transvaginal ultrasound at about 4–5 weeks gestation, before yolk sac and heartbeat appear.",
    "additional": "Exam pearl: By 5–6 weeks, the yolk sac appears, and by 6–7 weeks, cardiac activity is usually visible. Nurses should reassure mothers that absence of heartbeat before 6 weeks may be normal. Prediction: NCK exams often test the chronological order of sonographic findings."
  },
  {
    "question_text": "Which is the most important danger sign in pregnancy requiring immediate referral?",
    "option_a": "Mild ankle edema",
    "option_b": "Backache",
    "option_c": "Severe headache with blurred vision",
    "option_d": "Nausea and vomiting",
    "correct_answer": "C",
    "explanation": "Severe headache with visual disturbances is a red flag for severe pre-eclampsia or impending eclampsia, requiring urgent referral and treatment.",
    "additional": "Exam pearl: Other key danger signs include vaginal bleeding, severe abdominal pain, convulsions, reduced fetal movements, and high fever. Nurses must educate mothers on recognizing and reporting these signs early. In exams, blurred vision + headache almost always points to pre-eclampsia complications."
  },
  {
    "question_text": "Which is the most common cause of neonatal death in the first week of life?",
    "option_a": "Birth asphyxia",
    "option_b": "Sepsis",
    "option_c": "Prematurity",
    "option_d": "Congenital anomalies",
    "correct_answer": "A",
    "explanation": "Birth asphyxia is the leading cause of death in the first 7 days of life, especially in low-resource settings where neonatal resuscitation may not be readily available. Lack of oxygen at birth damages vital organs including the brain and heart, leading to high mortality if not corrected immediately.",
    "additional": "Exam pearl: Skilled birth attendants and proper neonatal resuscitation (clearing airway, stimulation, bag-mask ventilation) reduce deaths. Nurses should anticipate risk factors such as prolonged labor, obstructed labor, or maternal complications. NCK exams frequently test 'birth asphyxia' as the top cause of early neonatal death."
  },
  {
    "question_text": "Which is the most common cause of postpartum hemorrhage?",
    "option_a": "Uterine atony",
    "option_b": "Retained placental tissue",
    "option_c": "Genital tract trauma",
    "option_d": "Coagulopathy",
    "correct_answer": "A",
    "explanation": "Uterine atony, the failure of the uterus to contract effectively after delivery, is the primary cause of postpartum hemorrhage. Without contraction, the open uterine sinuses continue to bleed heavily.",
    "additional": "Exam pearl: Nurses prevent atony by administering oxytocin, massaging the uterus, and practicing active management of the third stage of labor (AMTSL). If atony persists, escalate to ergometrine, misoprostol, or bimanual compression. Exam predictions: At least one PPH question always emphasizes 'uterine atony' as the main cause."
  },
  {
    "question_text": "Which is the earliest clinical sign of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Breast tenderness",
    "option_c": "Chadwick’s sign",
    "option_d": "Quickening",
    "correct_answer": "A",
    "explanation": "The earliest and most common clinical sign of pregnancy is amenorrhea, usually recognized by the woman within a few weeks of conception. Other signs like quickening or Chadwick’s sign appear later.",
    "additional": "Exam pearl: Presumptive signs = amenorrhea, breast changes, nausea; probable signs = enlarged abdomen, cervical changes; positive signs = FHR or fetal movements felt by examiner. NCK often asks students to distinguish these categories."
  },
  {
    "question_text": "Which condition is most associated with oligohydramnios?",
    "option_a": "Renal agenesis",
    "option_b": "Esophageal atresia",
    "option_c": "Multiple pregnancy",
    "option_d": "Polyhydramnios",
    "correct_answer": "A",
    "explanation": "Renal agenesis (absence of fetal kidneys) prevents urine formation, the main source of amniotic fluid in later pregnancy, leading to severe oligohydramnios. This is often associated with Potter’s sequence (pulmonary hypoplasia and limb deformities).",
    "additional": "Exam pearl: Other causes include prolonged pregnancy, ruptured membranes, and IUGR. Nurses must monitor amniotic fluid levels, fetal growth, and advise referral if oligohydramnios is suspected. Exams often pair 'renal agenesis = oligohydramnios' vs. 'esophageal atresia = polyhydramnios'."
  },
  {
    "question_text": "Which is the most effective intervention to prevent eclampsia in severe pre-eclampsia?",
    "option_a": "Antihypertensives",
    "option_b": "Magnesium sulfate",
    "option_c": "Sedatives",
    "option_d": "Early delivery only",
    "correct_answer": "B",
    "explanation": "Magnesium sulfate is the gold-standard anticonvulsant for preventing and treating eclamptic seizures. Antihypertensives lower BP but do not prevent seizures, while delivery is definitive but MgSO₄ is required during stabilization.",
    "additional": "Exam pearl: Nurses administer MgSO₄ using Pritchard or Zuspan regimens, monitor reflexes, respirations, and urine output to avoid toxicity. Calcium gluconate is the antidote. NCK exams often ask: 'Which drug prevents eclampsia?' → Magnesium sulfate."
  },
  {
    "question_text": "Which is the best indicator of fetal lung maturity?",
    "option_a": "Amniotic fluid L/S ratio ≥2",
    "option_b": "Presence of fetal breathing movements",
    "option_c": "Fetal heart rate reactivity",
    "option_d": "Fundal height",
    "correct_answer": "A",
    "explanation": "An L/S (lecithin/sphingomyelin) ratio of ≥2 in amniotic fluid indicates sufficient surfactant for effective lung function at birth, reducing risk of respiratory distress syndrome.",
    "additional": "Exam pearl: Antenatal corticosteroids (betamethasone, dexamethasone) accelerate fetal lung maturity. NCK often tests biochemical markers like L/S ratio, or clinical equivalents (gestation >34 weeks usually = mature lungs)."
  },
  {
    "question_text": "Which is the safest method of sterilization in women?",
    "option_a": "Tubal ligation",
    "option_b": "Hysterectomy",
    "option_c": "Salpingectomy",
    "option_d": "Oophorectomy",
    "correct_answer": "A",
    "explanation": "Tubal ligation is the safest and most widely used method of female sterilization. It is effective, minimally invasive, and has fewer complications compared to hysterectomy or oophorectomy.",
    "additional": "Exam pearl: Nurses counsel on permanency, possible regret in young women, and surgical risks. Increasingly, salpingectomy is being promoted to reduce ovarian cancer risk, but tubal ligation remains the exam favorite."
  },
  {
    "question_text": "Which of the following is the best method of monitoring labor progress?",
    "option_a": "Fetal heart auscultation",
    "option_b": "Abdominal palpation",
    "option_c": "Partograph",
    "option_d": "Frequency of contractions",
    "correct_answer": "C",
    "explanation": "The partograph is the gold-standard tool for monitoring labor progress, integrating cervical dilation, descent, contractions, and fetal condition.",
    "additional": "Exam pearl: Nurses must be able to plot and interpret alert and action lines on the partograph. Common exam trap: While FHR and contractions are important, the partograph is the 'best method'."
  },
  {
    "question_text": "Which fetal presentation is most favorable for vaginal delivery?",
    "option_a": "Breech",
    "option_b": "Transverse lie",
    "option_c": "Occipito-anterior",
    "option_d": "Face presentation",
    "correct_answer": "C",
    "explanation": "The occipito-anterior position aligns the smallest diameter of the fetal head with the maternal pelvis, making vaginal delivery easiest and safest.",
    "additional": "Exam pearl: Occipito-posterior positions prolong labor, breech increases complications, and transverse requires cesarean. In NCK papers, OA = always correct for 'most favorable position'."
  },
  {
    "question_text": "Which complication is most associated with premature rupture of membranes (PROM)?",
    "option_a": "Cord prolapse",
    "option_b": "Preterm labor",
    "option_c": "Chorioamnionitis",
    "option_d": "All of the above",
    "correct_answer": "D",
    "explanation": "PROM predisposes to all three listed complications: cord prolapse, ascending infection (chorioamnionitis), and preterm labor. Infection risk increases the longer membranes are ruptured.",
    "additional": "Exam pearl: Nurses should monitor maternal temperature, fetal heart rate, and liquor smell/appearance. Sterile speculum exam confirms diagnosis. NCK often tests PROM with 'chorioamnionitis' as the most feared complication, but if 'all of the above' is an option, it’s usually correct."
  },
  {
    "question_text": "Which is the most common cause of antepartum hemorrhage?",
    "option_a": "Placenta previa",
    "option_b": "Abruptio placentae",
    "option_c": "Vasa previa",
    "option_d": "Uterine rupture",
    "correct_answer": "A",
    "explanation": "Placenta previa, where the placenta implants in the lower uterine segment, is the leading cause of antepartum hemorrhage. It presents with painless, recurrent vaginal bleeding in the third trimester.",
    "additional": "Exam pearl: Classic distinction—Placenta previa = painless bright red bleeding; Abruptio placentae = painful bleeding with uterine tenderness. Nurses must avoid digital vaginal exams in suspected placenta previa due to risk of massive hemorrhage. Common exam prediction: 'Most common cause of APH' → Placenta previa."
  },
  {
    "question_text": "Which is the most common cause of obstructed labor in primigravidae?",
    "option_a": "Cephalopelvic disproportion",
    "option_b": "Malpresentation",
    "option_c": "Uterine rupture",
    "option_d": "Multiple pregnancy",
    "correct_answer": "A",
    "explanation": "Cephalopelvic disproportion (CPD), where the fetal head is too large to pass through the maternal pelvis, is the commonest cause of obstructed labor in first pregnancies.",
    "additional": "Exam pearl: Nurses use the partograph to detect slow cervical dilation and non-descent of the presenting part. Management requires cesarean delivery. Prediction: CPD is almost always the answer when 'primigravida + obstructed labor' appears in a question."
  },
  {
    "question_text": "Which is the most specific test to confirm pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Positive urine pregnancy test",
    "option_c": "Detection of fetal heart sounds",
    "option_d": "Breast changes",
    "correct_answer": "C",
    "explanation": "Detection of fetal heart sounds (by Doppler at ~10–12 weeks or fetoscope at ~20 weeks) is a positive and confirmatory sign of pregnancy.",
    "additional": "Exam pearl: NCK tests require you to differentiate presumptive, probable, and positive signs. Remember: only three are truly 'positive'—fetal heart sounds, fetal movements felt by examiner, and ultrasound visualization of fetus."
  },
  {
    "question_text": "Which is the leading cause of maternal mortality globally?",
    "option_a": "Postpartum hemorrhage",
    "option_b": "Hypertensive disorders",
    "option_c": "Sepsis",
    "option_d": "Unsafe abortion",
    "correct_answer": "A",
    "explanation": "Postpartum hemorrhage is the leading cause of maternal death worldwide, especially in sub-Saharan Africa and Asia. It results mainly from uterine atony, retained placenta, or trauma.",
    "additional": "Exam pearl: Prevention through AMTSL (oxytocin, controlled cord traction, uterine massage) saves lives. NCK papers repeatedly emphasize PPH as 'the number one cause of maternal mortality'."
  },
  {
    "question_text": "Which is the most common cause of neonatal sepsis in the first week of life?",
    "option_a": "Group B Streptococcus",
    "option_b": "Staphylococcus aureus",
    "option_c": "Listeria monocytogenes",
    "option_d": "Klebsiella pneumoniae",
    "correct_answer": "A",
    "explanation": "Group B Streptococcus is the leading cause of early-onset neonatal sepsis, acquired from the maternal genital tract during delivery.",
    "additional": "Exam pearl: Signs include poor feeding, respiratory distress, lethargy, and hypothermia. Nurses provide aseptic delivery practices and early recognition. Prediction: In NCK exams, Group B Strep = first week sepsis; Klebsiella often = late-onset sepsis in hospital settings."
  },
  {
    "question_text": "Which is the best method for diagnosing ectopic pregnancy?",
    "option_a": "Culdocentesis",
    "option_b": "Urine pregnancy test",
    "option_c": "Transvaginal ultrasound",
    "option_d": "Serial hemoglobin estimation",
    "correct_answer": "C",
    "explanation": "Transvaginal ultrasound is the most accurate and earliest diagnostic tool for ectopic pregnancy, detecting an empty uterus with adnexal mass or gestational sac.",
    "additional": "Exam pearl: Nurses should suspect ectopic in women with abdominal pain, amenorrhea, and vaginal bleeding (classic triad). NCK often asks: 'Best investigation for ectopic' → TVS."
  },
  {
    "question_text": "Which is the earliest detectable sign of pregnancy on ultrasound?",
    "option_a": "Gestational sac",
    "option_b": "Yolk sac",
    "option_c": "Fetal pole",
    "option_d": "Fetal heartbeat",
    "correct_answer": "A",
    "explanation": "The gestational sac is the first sonographic finding of pregnancy, visible on transvaginal ultrasound around 4–5 weeks.",
    "additional": "Exam pearl: Sequence on ultrasound—gestational sac (4–5 weeks), yolk sac (5 weeks), fetal pole (5.5–6 weeks), cardiac activity (6–7 weeks). NCK often tests this timeline."
  },
  {
    "question_text": "Which is the most effective drug for preventing eclampsia?",
    "option_a": "Diazepam",
    "option_b": "Magnesium sulfate",
    "option_c": "Phenytoin",
    "option_d": "Phenobarbital",
    "correct_answer": "B",
    "explanation": "Magnesium sulfate is the drug of choice for both prevention and treatment of seizures in pre-eclampsia and eclampsia. Other anticonvulsants are less effective and pose neonatal risks.",
    "additional": "Exam pearl: Nurses must know MgSO₄ regimens (Pritchard, Zuspan), monitor for toxicity, and keep calcium gluconate as antidote. NCK prediction: any question asking 'drug of choice in eclampsia' → MgSO₄."
  },
  {
    "question_text": "Which is the best method of assessing cervical readiness for induction?",
    "option_a": "Digital dilation measurement",
    "option_b": "Bishop score",
    "option_c": "Fundal height",
    "option_d": "Ultrasound",
    "correct_answer": "B",
    "explanation": "The Bishop score assesses dilation, effacement, station, position, and consistency of the cervix. A score ≥8 suggests a favorable cervix for induction.",
    "additional": "Exam pearl: Nurses should remember the five components of Bishop score for exams. NCK often frames this as 'Best method for cervical ripening assessment' → Bishop score."
  },
  {
    "question_text": "Which is the most common cause of breech presentation?",
    "option_a": "Polyhydramnios",
    "option_b": "Prematurity",
    "option_c": "Multiple pregnancy",
    "option_d": "Placenta previa",
    "correct_answer": "B",
    "explanation": "Prematurity is the most frequent cause of breech presentation, since the fetus has not yet rotated to cephalic presentation.",
    "additional": "Exam pearl: Breech risk increases with prematurity, uterine anomalies, and multiple pregnancies. Nurses should anticipate complications such as cord prolapse and birth trauma. Exam tip: 'Most common cause of breech' → Prematurity."
  },
  {
    "question_text": "Which is the most common complication of polyhydramnios?",
    "option_a": "Cord prolapse",
    "option_b": "Postpartum hemorrhage",
    "option_c": "Preterm labor",
    "option_d": "All of the above",
    "correct_answer": "D",
    "explanation": "Polyhydramnios predisposes to all listed complications—cord prolapse, uterine overdistension causing PPH, and preterm labor.",
    "additional": "Exam pearl: Nurses should prepare for cord prolapse at membrane rupture and anticipate atony after delivery. If 'all of the above' is an option in exams, it’s often correct for polyhydramnios complications."
  },
  {
    "question_text": "Which is the best intervention to prevent neonatal tetanus?",
    "option_a": "Clean cord care",
    "option_b": "Maternal tetanus immunization",
    "option_c": "Neonatal antibiotics",
    "option_d": "Immediate breastfeeding",
    "correct_answer": "B",
    "explanation": "Maternal tetanus toxoid immunization during pregnancy provides antibodies that cross the placenta, protecting the baby at birth.",
    "additional": "Exam pearl: Nurses should ensure pregnant women receive at least 2 TT doses. Clean cord care complements but does not replace immunization. NCK frequently tests this preventive strategy."
  }
]







