[
  {
    "question_text": "The condition for which a nurse prepares a woman for emergency caesarean delivery is:-",
    "option_a": "Prolapsed cord",
    "option_b": "Twin pregnancy",
    "option_c": "Meconium-stained amniotic fluid",
    "option_d": "A non-reactive non-stress test",
    "correct_answer": "A",
    "explanation": "Prolapsed umbilical cord occurs when the cord slips past the presenting fetal part and lies in or outside the cervix. This leads to cord compression, occlusion of blood supply, and rapid fetal hypoxia. The only definitive and safe management is emergency caesarean section to save the fetus. Twin pregnancy or meconium-stained liquor are not emergencies unless complications arise. A non-reactive non-stress test requires further evaluation, not immediate CS.",
    "additional": "In NCK and NCLEX exams, obstetric emergencies like cord prolapse, eclampsia, shoulder dystocia, and abruptio placentae are high-yield. Nurses must remember to place the mother in knee-chest or Trendelenburg position while awaiting CS to relieve cord compression. Wrapping the cord in a warm moist towel prevents vasospasm. Key predictor for exams: Any situation where fetal oxygenation is compromised requires fast intervention."
  },
  {
    "question_text": "To screen for the presence of neural tube defects in the fetus, the test that would be performed on a pregnant woman is:-",
    "option_a": "Biophysical profile",
    "option_b": "Amniocentesis",
    "option_c": "Serum alpha-fetoprotein",
    "option_d": "TORCH titres",
    "correct_answer": "C",
    "explanation": "Serum alpha-fetoprotein (AFP) is a maternal blood test used in the second trimester to screen for neural tube defects like spina bifida and anencephaly. Elevated AFP indicates possible open defects, while low AFP may suggest Down syndrome. Amniocentesis can provide confirmatory results, but the screening test of choice is AFP.",
    "additional": "High-yield revision point: Folic acid supplementation (400 mcg/day preconception and 600 mcg/day in pregnancy) prevents neural tube defects. TORCH titres are used to detect intrauterine infections like Toxoplasmosis, Rubella, CMV, and HSV. Biophysical profile assesses fetal well-being, not structural anomalies. Always remember: abnormal AFP → follow-up with ultrasound and possibly amniocentesis."
  },
  {
    "question_text": "During first examination of a normal newborn baby, a nurse would expect to identify:-",
    "option_a": "Apical pulse rate of 90 beats per minute",
    "option_b": "Hands and feet that have a bluish color",
    "option_c": "Eye discharge that is yellow and watery",
    "option_d": "Umbilical stump that has two veins and one artery",
    "correct_answer": "B",
    "explanation": "Bluish coloration of the extremities, known as acrocyanosis, is normal in newborns during the first 24–48 hours due to immature circulation. A pulse of 90 is abnormally low since newborns normally have 120–160 bpm. The umbilical cord normally has two arteries and one vein, not two veins. Yellow watery eye discharge suggests infection and is abnormal.",
    "additional": "Normal newborn findings: molding of the head, vernix caseosa, lanugo, transient murmurs, and Mongolian spots. Danger signs include persistent central cyanosis, tachypnea, nasal flaring, or abnormal cord vessels (which may indicate renal anomalies). On exams, remember: acrocyanosis is normal, generalized cyanosis is not."
  },
  {
    "question_text": "For a woman in labor experiencing slight shoulder dystocia the nurse would:-",
    "option_a": "Place her in knee-chest position",
    "option_b": "Apply fundal pressure to the suprapubic area",
    "option_c": "Prepare for assisted forceps delivery",
    "option_d": "Obtain an order for oxytocin infusion",
    "correct_answer": "B",
    "explanation": "Shoulder dystocia occurs when the fetal shoulders fail to deliver after the head. The first-line maneuver is suprapubic pressure, which decreases the bisacromial diameter and helps the shoulder slip under the pubic symphysis. Fundal pressure is contraindicated as it worsens impaction and risks uterine rupture. Oxytocin infusion is inappropriate in an obstructed situation. Forceps may be needed later, but initial management is suprapubic pressure.",
    "additional": "Exam tip: Key maneuvers in shoulder dystocia include McRoberts maneuver (flexing the mother’s legs onto her abdomen) and applying suprapubic pressure. Avoid fundal pressure. Complications include brachial plexus injury, hypoxia, and maternal lacerations. Nursing priorities: call for help, anticipate neonatal resuscitation, and document events accurately."
  },
  {
    "question_text": "A laboring woman’s husband assists her during the transitional phase of labor. The behavior that would require nurse’s intervention is:-",
    "option_a": "Offers the woman a bed pan when she needs to have a bowel movement",
    "option_b": "Gives ice-chips to the woman when she says her mouth is dry",
    "option_c": "Provides effleurage when the woman complains of intense abdominal pain",
    "option_d": "Encourages the woman to fix her gaze on him when she experiences a contraction",
    "correct_answer": "A",
    "explanation": "During the transitional phase, the urge to defecate may indicate that the fetal head is descending and the second stage is near. Offering a bedpan is inappropriate; instead, the nurse should assess for full dilation and support pushing only when appropriate. The other options are supportive behaviors that help coping.",
    "additional": "Exam focus: In late labor, bowel movement sensations usually signal crowning or fetal head pressure. The nurse should check for cervical dilation before allowing pushing. Encouraging ice chips, breathing techniques, and relaxation are all correct supportive measures. Watch out for misleading exam options that test inappropriate interventions."
  },
  {
    "question_text": "To help a woman recognize the best time for conceiving a nurse would instruct her to monitor for:-",
    "option_a": "Drop in body temperature lasting several days",
    "option_b": "Increase in amount of cervical mucus that is clear and stretchy",
    "option_c": "Abdominal bloating that occurs suddenly",
    "option_d": "Breast tenderness accompanied by slight nipple discharge",
    "correct_answer": "B",
    "explanation": "Ovulation is marked by thin, clear, stretchy cervical mucus (spinnbarkeit sign). This is the best time for conception because sperm can move easily through the mucus. A temperature rise occurs after ovulation, not before. Breast tenderness and bloating are premenstrual or luteal phase symptoms.",
    "additional": "Natural family planning methods rely on signs of ovulation: cervical mucus changes, basal body temperature rise, and Mittelschmerz (mid-cycle pain). Exams often test on spinnbarkeit mucus as the hallmark sign. Key for nurses: teaching women how to chart fertility signs for either conception or contraception."
  },
  {
    "question_text": "The sign that leads a nurse to suspect that a two-week-old premature infant may be having apnea is:-",
    "option_a": "Intermittent episodes of acrocyanosis for 10 minutes",
    "option_b": "Random episodes of breath-holding during stress",
    "option_c": "Transient episodes of mottling with temperature changes",
    "option_d": "A lapse of spontaneous breathing for 20 seconds",
    "correct_answer": "D",
    "explanation": "Apnea of prematurity is defined as cessation of breathing for at least 20 seconds, often associated with bradycardia and cyanosis. Shorter pauses or acrocyanosis alone are normal in neonates. Mottling is a benign vascular response to cold stress, not apnea.",
    "additional": "High-yield: Premature infants are at high risk for apnea due to immature respiratory centers. Nursing care includes monitoring with apnea alarms, gentle stimulation during episodes, and considering methylxanthine therapy (caffeine, theophylline). Always differentiate between periodic breathing (normal) and true apnea (pathological)."
  },
  {
    "question_text": "When performing a physical assessment of a woman who is 20 weeks pregnant, a nurse would expect to palpate the uterine fundus at:-",
    "option_a": "Symphysis pubis",
    "option_b": "Midway between symphysis pubis and umbilicus",
    "option_c": "Umbilicus",
    "option_d": "Midway between umbilicus and xiphoid process",
    "correct_answer": "C",
    "explanation": "At 20 weeks gestation, the fundus is palpated at the level of the umbilicus. At 12 weeks, it is just above the symphysis pubis. At 36 weeks, it reaches the xiphoid process. Fundal height in centimeters roughly corresponds to weeks of gestation between 20–36 weeks.",
    "additional": "Exam hack: memorize fundal height landmarks—12 weeks (symphysis pubis), 20 weeks (umbilicus), 36 weeks (xiphoid). After 36 weeks, lightening occurs and the fundus drops slightly. This concept is often tested to check knowledge of antenatal assessment."
  },
  {
    "question_text": "A woman complains of morning sickness during the first trimester of pregnancy. To alleviate the symptoms, she should:-",
    "option_a": "Consume a clear liquid diet",
    "option_b": "Take prenatal vitamins with milk",
    "option_c": "Eat foods that are low in protein",
    "option_d": "Avoid exposure to noxious odors",
    "correct_answer": "D",
    "explanation": "Morning sickness is caused by hormonal changes (especially high hCG). Avoiding strong odors, eating small frequent meals, and avoiding greasy foods help. Protein is actually beneficial, not harmful. Vitamins are better tolerated at night rather than with milk. A clear liquid diet is too restrictive.",
    "additional": "Hyperemesis gravidarum is the severe form, associated with dehydration, weight loss, electrolyte imbalance, and hospitalization. Nursing role: encourage dietary modifications, ginger, B6 supplementation, and monitor hydration. In exams, always distinguish normal morning sickness from hyperemesis."
  },
  {
    "question_text": "The midwife should suspect pregnancy induced hypertension if during a client’s assessment she finds the following:-",
    "option_a": "Ankle oedema and proteinuria",
    "option_b": "Glycosuria and proteinuria",
    "option_c": "Proteinuria and hypertension",
    "option_d": "Hypertension and hyporeflexia",
    "correct_answer": "C",
    "explanation": "Pregnancy Induced Hypertension (PIH) is diagnosed when a previously normotensive woman develops hypertension (≥140/90 mmHg) after 20 weeks of pregnancy, often accompanied by proteinuria. Edema alone is no longer a diagnostic criterion because it is common in normal pregnancy. Hyporeflexia suggests magnesium toxicity, not PIH.",
    "additional": "PIH spectrum includes gestational hypertension, pre-eclampsia, and eclampsia. High-yield exam clue: pre-eclampsia = hypertension + proteinuria ± edema; eclampsia = pre-eclampsia + seizures. Management includes antihypertensives (labetalol, hydralazine), magnesium sulfate to prevent seizures, and monitoring for complications such as HELLP syndrome. Nurses should monitor deep tendon reflexes, urine output, and fetal well-being closely."
  },
  {
    "question_text": "The treatment of puerperal mastitis before suppuration occurs is:-",
    "option_a": "Antibiotics, breast support and ice application",
    "option_b": "Antibiotics, breast support and heat application",
    "option_c": "Antibiotics, aspiration and breast support",
    "option_d": "Antibiotics, incision and drainage, breast support",
    "correct_answer": "B",
    "explanation": "Puerperal mastitis is infection of breast tissue, usually due to Staphylococcus aureus, occurring during lactation. Early treatment includes antibiotics, breast support, continued breastfeeding or emptying the breast, and local application of warm compresses to relieve discomfort and improve milk flow. Incision and drainage are required only if abscess forms.",
    "additional": "Exams often test differentiation between mastitis and breast engorgement. Mastitis presents with localized pain, fever, and erythema, whereas engorgement is bilateral, generalized, and non-infective. Nurses play a key role in encouraging continued breastfeeding, as sudden cessation worsens stasis. Warm compresses improve circulation, unlike ice which is used for engorgement relief."
  },
  {
    "question_text": "State five functions of amniotic fluid.",
    "option_a": "Facilitates maternal respiration, provides immunity, stores fat, prevents congenital anomalies, aids in digestion",
    "option_b": "Prevents dehydration, regulates fetal temperature, provides nutrition, aids in uterine contractions, strengthens bones",
    "option_c": "Allows fetal movement for bone growth, aids lung development, maintains constant temperature, cushions against injury, facilitates waste exchange",
    "option_d": "Protects placenta, prevents anemia, stimulates hormone release, improves circulation, protects cervix",
    "correct_answer": "C",
    "explanation": "Amniotic fluid surrounds and protects the fetus. Its functions include cushioning the fetus from trauma, allowing free movement for musculoskeletal development, helping lungs mature by allowing fetal breathing movements, maintaining a stable intrauterine temperature, and preventing adhesions between fetal parts. It also plays a role in metabolic and fluid balance.",
    "additional": "High-yield: At term, amniotic fluid averages 600 mL. Polyhydramnios is associated with GI anomalies (e.g., esophageal atresia), while oligohydramnios is linked to renal anomalies (e.g., renal agenesis, Potter syndrome). Nurses should monitor amniotic fluid volume on ultrasound and during rupture of membranes."
  },
  {
    "question_text": "Pregnancy brings about changes in all body systems. Which of the following occur in the endocrine system?",
    "option_a": "Placenta produces hormones, thyroid enlargement, increased cortisol and aldosterone, increased prolactin, increased insulin resistance",
    "option_b": "Decreased thyroid activity, decreased pituitary size, decreased prolactin, decreased ACTH, increased sensitivity to insulin",
    "option_c": "Placenta suppresses all maternal hormones, pituitary shrinks, pancreas reduces insulin, thyroid gland atrophies",
    "option_d": "Progesterone secretion decreases, TSH levels decrease, adrenal hormones decrease, parathyroid hormones remain unchanged",
    "correct_answer": "A",
    "explanation": "Pregnancy is associated with significant endocrine changes. The placenta produces hCG, progesterone, estrogen, and human placental lactogen. The thyroid enlarges due to increased binding globulins. Adrenal gland activity increases cortisol and aldosterone, while prolactin levels rise significantly due to pituitary stimulation. Insulin resistance increases due to placental hormones, predisposing to gestational diabetes.",
    "additional": "Exam hack: Always connect endocrine changes to clinical conditions. For example: gestational diabetes results from insulin resistance; thyroid enlargement mimics hyperthyroidism; increased aldosterone contributes to edema. Nurses should screen for gestational diabetes between 24–28 weeks with oral glucose tolerance test."
  },
  {
    "question_text": "State three ways in which a midwife can prevent occurrence of puerperal sepsis.",
    "option_a": "Strict aseptic technique during delivery, frequent changing of pads, monitoring vital signs",
    "option_b": "Giving high-protein diet, monitoring fetal heart rate, encouraging ambulation",
    "option_c": "Checking cervical dilatation frequently, administering diuretics, restricting fluids",
    "option_d": "Performing perineal massage, encouraging prolonged labor, avoiding sterile gloves",
    "correct_answer": "A",
    "explanation": "Puerperal sepsis is infection of the genital tract occurring between rupture of membranes and 42 days postpartum. Prevention relies on aseptic techniques during labor and delivery, prompt management of prolonged rupture of membranes, maintaining perineal hygiene, and monitoring maternal vital signs for early detection.",
    "additional": "NCK frequently tests puerperal sepsis due to its high maternal mortality contribution. Nurses should educate mothers on perineal care, hand washing, and signs of infection (fever, foul-smelling lochia). High-risk factors: prolonged labor, multiple vaginal examinations, retained products, and anemia. WHO defines puerperal sepsis as infection leading to fever ≥38°C within 10 days postpartum."
  },
  {
    "question_text": "Health education to mothers is one of the aims of antenatal care. Which topics should be included?",
    "option_a": "Breastfeeding, common discomforts in pregnancy, substance abuse education",
    "option_b": "Laboratory equipment use, malaria treatment, newborn immunization schedules only",
    "option_c": "Father’s health care, farming techniques, water treatment only",
    "option_d": "Menopause management, geriatrics, cardiovascular rehabilitation",
    "correct_answer": "A",
    "explanation": "Antenatal health education aims to prepare mothers for pregnancy, labor, and postpartum. Topics include nutrition, breastfeeding, recognition of danger signs, hygiene, rest and exercise, birth preparedness, and avoidance of harmful substances. This ensures better maternal and neonatal outcomes.",
    "additional": "Exam tip: Always connect health education to key danger signs—bleeding, severe headache, swelling, visual changes, fever. Nurses should empower mothers on birth preparedness (transport, finances, skilled attendant). NCLEX and NCK both test on anticipatory guidance during antenatal visits."
  },
  {
    "question_text": "Acute inversion of the uterus is an obstetric emergency. Which of the following are causes?",
    "option_a": "Precipitate labor, traction on short cord, submucous fundal myoma, mismanagement of third stage",
    "option_b": "Polyhydramnios, twin pregnancy, cord prolapse, macrosomia",
    "option_c": "Placenta previa, premature rupture of membranes, oligohydramnios, cephalopelvic disproportion",
    "option_d": "Fetal distress, shoulder dystocia, prolonged latent phase, breech presentation",
    "correct_answer": "A",
    "explanation": "Uterine inversion occurs when the fundus collapses into or outside the uterine cavity, often due to excessive traction on the umbilical cord, fundal pressure, or structural abnormalities like myomas. It presents with hemorrhage and shock.",
    "additional": "NCK exams test on recognition and management of obstetric emergencies. Management: call for help, resuscitate mother with IV fluids, manually replace uterus, administer uterotonics after replacement, and proceed to laparotomy if unsuccessful. Nurses must recognize signs early—mass protruding through cervix, severe postpartum hemorrhage, shock out of proportion to blood loss."
  },
  {
    "question_text": "Describe the changes that occur in fetal circulation after birth.",
    "option_a": "Closure of foramen ovale, ductus arteriosus, and ductus venosus; lungs take over gas exchange; umbilical vessels become ligaments",
    "option_b": "Pulmonary circulation stops, placenta takes over oxygenation, umbilical vessels remain patent, heart circulation unchanged",
    "option_c": "Blood bypasses lungs permanently, umbilical vein continues to supply oxygen, ductus venosus remains open",
    "option_d": "Cardiac output decreases, placenta resumes circulation, systemic circulation bypasses lungs",
    "correct_answer": "A",
    "explanation": "After birth, lung expansion allows gas exchange. Increased left atrial pressure causes closure of foramen ovale. Ductus arteriosus constricts and becomes ligamentum arteriosum. Umbilical arteries and vein close and become ligaments. Ductus venosus also closes. This shifts circulation from parallel to serial flow.",
    "additional": "Exam pearls: Key fetal shunts—Foramen ovale (RA → LA), Ductus arteriosus (PA → aorta), Ductus venosus (umbilical vein → IVC). Failure of closure leads to congenital conditions like patent ductus arteriosus (PDA) and atrial septal defects (ASD). Nurses must be able to identify normal vs pathological murmurs in neonates."
  },
  {
    "question_text": "Which of the following are contraindications to breastfeeding?",
    "option_a": "Maternal HIV infection, infant galactosemia, maternal untreated TB, active herpes lesions on breast",
    "option_b": "Maternal hypertension, maternal anemia, infant jaundice, cesarean birth",
    "option_c": "Mother on iron therapy, infant with prematurity, mother with mastitis, mother with obesity",
    "option_d": "Mother with epilepsy, infant with low weight, mother with malaria, infant with vomiting",
    "correct_answer": "A",
    "explanation": "Absolute contraindications to breastfeeding include maternal HIV (in settings without safe alternatives), untreated TB, herpes lesions on the breast, active varicella, maternal illicit drug use, and infant metabolic conditions like galactosemia. Most maternal illnesses (like anemia, malaria, mastitis) are not contraindications.",
    "additional": "NCK emphasizes safe breastfeeding practices. Nurses should encourage breastfeeding unless there is a clear contraindication. For HIV-positive mothers, WHO recommends exclusive breastfeeding with maternal ART where safe alternatives are not feasible. Key exam focus: differentiate true contraindications from conditions where breastfeeding should continue."
  },
  {
    "question_text": "A woman at 30 weeks gestation is admitted with painless vaginal bleeding. The nurse suspects:-",
    "option_a": "Placenta previa",
    "option_b": "Abruptio placentae",
    "option_c": "Vasa previa",
    "option_d": "Uterine rupture",
    "correct_answer": "A",
    "explanation": "Placenta previa presents with painless, bright red vaginal bleeding in the second or third trimester. The placenta is implanted abnormally low, covering or near the cervical os. Unlike abruption, there is no abdominal pain, uterine tenderness, or increased tone.",
    "additional": "Key differential: Placenta previa = painless bleeding; Abruptio placenta = painful bleeding + hard tender uterus; Uterine rupture = sudden cessation of contractions + fetal distress; Vasa previa = bleeding after rupture of membranes with fetal bradycardia. Nurses must avoid vaginal examination in suspected previa to prevent hemorrhage. Definitive diagnosis is via ultrasound."
  },
  {
    "question_text": "During the second stage of labor, the nurse observes crowning. What is the correct immediate action?",
    "option_a": "Encourage the woman to breathe rapidly through her mouth",
    "option_b": "Apply gentle pressure on the fetal head",
    "option_c": "Ask the woman to push forcefully with each contraction",
    "option_d": "Prepare for immediate instrumental delivery",
    "correct_answer": "B",
    "explanation": "Crowning occurs when the widest part of the fetal head remains visible at the vulva. The nurse should apply gentle counter-pressure to control delivery of the head and prevent perineal tears. Rapid breathing reduces urge to push but does not control head delivery. Forceful pushing may cause trauma.",
    "additional": "Exam point: Controlled delivery of the head reduces perineal trauma and fetal injury. Episiotomy may be indicated if there is risk of severe perineal tear. Nurses should support the perineum with one hand (modified Ritgen’s maneuver) while guiding the head with the other."
  },
  {
    "question_text": "A pregnant woman develops eclampsia. The drug of choice to prevent further convulsions is:-",
    "option_a": "Diazepam",
    "option_b": "Phenobarbital",
    "option_c": "Magnesium sulfate",
    "option_d": "Phenytoin",
    "correct_answer": "C",
    "explanation": "Magnesium sulfate is the anticonvulsant of choice in eclampsia. It stabilizes neuromuscular junctions and prevents seizures. Diazepam and phenytoin are less effective and associated with neonatal depression. Phenobarbital is rarely used.",
    "additional": "NCK often tests magnesium sulfate protocols. Nursing care: monitor deep tendon reflexes, respiratory rate (>12/min), and urine output (>30 ml/hr). Antidote is calcium gluconate. Therapeutic serum level: 4–7 mEq/L. Toxicity signs: loss of reflexes, respiratory depression, cardiac arrest."
  },
  {
    "question_text": "Which of the following is a danger sign in pregnancy?",
    "option_a": "Morning sickness in the first trimester",
    "option_b": "Mild pedal edema in the third trimester",
    "option_c": "Severe headache and blurred vision",
    "option_d": "Increased appetite in the second trimester",
    "correct_answer": "C",
    "explanation": "Severe headache, blurred vision, and epigastric pain are danger signs suggestive of pre-eclampsia or eclampsia. Mild edema is common in pregnancy, morning sickness is expected in the first trimester, and increased appetite is normal.",
    "additional": "Danger signs exams often focus on: vaginal bleeding, severe abdominal pain, convulsions, fever, absence of fetal movements, and swelling of face/hands. Nurses must teach mothers these signs during antenatal care to ensure timely reporting and management."
  },
  {
    "question_text": "The normal duration of the third stage of labor is:-",
    "option_a": "5–10 minutes",
    "option_b": "10–20 minutes",
    "option_c": "20–30 minutes",
    "option_d": "30–45 minutes",
    "correct_answer": "B",
    "explanation": "The third stage of labor (placental expulsion) normally lasts 10–20 minutes. Prolonged third stage increases risk of postpartum hemorrhage. Active management (oxytocin, controlled cord traction, uterine massage) helps shorten this stage.",
    "additional": "Exam point: Retained placenta = >30 minutes. Main complication: postpartum hemorrhage. Nurses should always check completeness of placenta and membranes after delivery. Active management of third stage is a key maternal mortality reduction strategy."
  },
  {
    "question_text": "Which presentation is most favorable for vaginal delivery?",
    "option_a": "Brow presentation",
    "option_b": "Face presentation",
    "option_c": "Vertex presentation",
    "option_d": "Shoulder presentation",
    "correct_answer": "C",
    "explanation": "Vertex presentation, where the fetal head is flexed and the occiput is the presenting part, is the most favorable for vaginal delivery. Brow, face, and shoulder presentations often require cesarean delivery.",
    "additional": "Exam hack: remember ‘Vertex = Victory’. Malpresentations (breech, face, brow, shoulder, compound) are associated with obstructed labor and require interventions. Nurses must assess presentation via Leopold’s maneuvers and vaginal examination when safe."
  },
  {
    "question_text": "The main risk factor for ectopic pregnancy is:-",
    "option_a": "History of multiple gestation",
    "option_b": "Pelvic inflammatory disease",
    "option_c": "Gestational diabetes",
    "option_d": "Previous cesarean section",
    "correct_answer": "B",
    "explanation": "PID leads to scarring and adhesions of fallopian tubes, impairing normal transport of the ovum and increasing risk of ectopic implantation. Other risks include prior ectopic pregnancy, tubal surgery, and intrauterine devices.",
    "additional": "Key exam points: Ectopic pregnancy presents with missed period, abdominal pain, and vaginal bleeding. Rupture leads to shock and hemoperitoneum. Nursing management: stabilize patient, prepare for surgery, and provide psychological support."
  },
  {
    "question_text": "In premature rupture of membranes at term, the nurse should anticipate:-",
    "option_a": "Induction of labor",
    "option_b": "Immediate cesarean section",
    "option_c": "Prolonged expectant management",
    "option_d": "Termination of pregnancy",
    "correct_answer": "A",
    "explanation": "PROM at term carries risk of infection (chorioamnionitis). Induction of labor is recommended if contractions do not start spontaneously within a short period. Cesarean is only for obstetric indications.",
    "additional": "High-yield: PROM <37 weeks = preterm PROM, managed expectantly with antibiotics and steroids unless complications arise. At term, induction is safe. Nurses monitor for maternal fever, foul liquor, and fetal tachycardia as infection signs."
  },
  {
    "question_text": "The most common cause of postpartum hemorrhage is:-",
    "option_a": "Genital tract trauma",
    "option_b": "Retained placental fragments",
    "option_c": "Uterine atony",
    "option_d": "Coagulation disorders",
    "correct_answer": "C",
    "explanation": "Uterine atony, the failure of the uterus to contract after delivery, is the leading cause of PPH. It results in continuous bleeding because uterine muscle contraction is essential for compressing blood vessels.",
    "additional": "NCK exam memory tip: The 4 T’s of PPH—Tone (atony, most common), Trauma (lacerations), Tissue (retained products), Thrombin (coagulopathies). Management includes uterine massage, oxytocin, ergometrine, misoprostol, and surgical interventions if needed."
  },
  {
    "question_text": "Which of the following is the most reliable sign of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Morning sickness",
    "option_c": "Positive fetal heart tones",
    "option_d": "Breast tenderness",
    "correct_answer": "C",
    "explanation": "Presumptive signs (amenorrhea, morning sickness, breast changes) suggest pregnancy but are not diagnostic. Probable signs include uterine enlargement. Positive signs include fetal heart tones, ultrasound visualization, and fetal movements palpated by examiner.",
    "additional": "Exam focus: Always distinguish between presumptive, probable, and positive signs of pregnancy. Nurses should counsel mothers that missed period alone is not confirmation. Doppler can detect fetal heart tones by 10–12 weeks."
  },
  {
    "question_text": "Which factor predisposes a woman to postpartum infection?",
    "option_a": "Prolonged rupture of membranes",
    "option_b": "Normal spontaneous vaginal delivery",
    "option_c": "Elective cesarean section with antibiotics",
    "option_d": "Short duration of labor",
    "correct_answer": "A",
    "explanation": "When membranes rupture for more than 18 hours before delivery, ascending infection risk increases, leading to chorioamnionitis or postpartum sepsis. Short labor and normal delivery do not increase risk. Cesarean with prophylactic antibiotics reduces risk compared to cesarean without antibiotics.",
    "additional": "High-risk factors for postpartum infection: prolonged rupture of membranes, prolonged labor, frequent vaginal exams, cesarean delivery without prophylaxis, anemia, and poor hygiene. Nurses must emphasize perineal care and monitor lochia, temperature, and uterine involution postpartum."
  },
  {
    "question_text": "A woman in active labor complains of severe backache. The most likely fetal position is:-",
    "option_a": "Left occipito-anterior",
    "option_b": "Right occipito-anterior",
    "option_c": "Occipito-posterior",
    "option_d": "Breech",
    "correct_answer": "C",
    "explanation": "Persistent backache in labor is typical of occipito-posterior position because the fetal occiput compresses the maternal sacrum. Occipito-anterior is the most favorable position, causing less discomfort. Breech presents with buttocks or feet, not backache.",
    "additional": "Exam hack: OP position = ‘Ouchy Pain’ (backache). Nurses help by encouraging maternal position changes like hands-and-knees, pelvic rocking, and side-lying to aid rotation. Malpositions are common causes of prolonged labor and increased operative delivery rates."
  },
  {
    "question_text": "Which of the following is an indication for induction of labor?",
    "option_a": "Placenta previa",
    "option_b": "Post-term pregnancy",
    "option_c": "Transverse lie",
    "option_d": "Cephalopelvic disproportion",
    "correct_answer": "B",
    "explanation": "Induction of labor is indicated in post-term pregnancy (>41–42 weeks), pre-eclampsia, intrauterine fetal demise, and PROM. Placenta previa and transverse lie are contraindications due to obstruction. CPD also contraindicates induction.",
    "additional": "Exams often test absolute vs relative contraindications to induction. Contraindications: placenta previa, malpresentation, CPD, previous classical cesarean. Nurses should prepare women for induction methods like oxytocin infusion and prostaglandins, while monitoring for uterine hyperstimulation."
  },
  {
    "question_text": "A mother with Rh-negative blood delivers an Rh-positive baby. The drug administered to prevent isoimmunization is:-",
    "option_a": "Anti-D immunoglobulin",
    "option_b": "Magnesium sulfate",
    "option_c": "Iron supplements",
    "option_d": "Methyldopa",
    "correct_answer": "A",
    "explanation": "Rh incompatibility occurs when an Rh-negative mother is exposed to Rh-positive fetal blood. Administering Anti-D immunoglobulin within 72 hours prevents maternal sensitization. Magnesium sulfate is for eclampsia, iron for anemia, and methyldopa for hypertension.",
    "additional": "Exam tip: Anti-D is also given at 28 weeks prophylactically, after abortion, ectopic pregnancy, or procedures like amniocentesis in Rh-negative women. Failure to give leads to hemolytic disease of the newborn in subsequent pregnancies."
  },
  {
    "question_text": "The most common site of fertilization in the female reproductive tract is:-",
    "option_a": "Uterine cavity",
    "option_b": "Ampulla of fallopian tube",
    "option_c": "Fimbrial end of fallopian tube",
    "option_d": "Cervical canal",
    "correct_answer": "B",
    "explanation": "Fertilization typically occurs in the ampullary region of the fallopian tube, which provides optimal conditions for sperm-egg interaction. Implantation then occurs in the uterine endometrium.",
    "additional": "Exams love to test fertilization site because ectopic pregnancy often occurs in fallopian tubes. If implantation occurs outside the uterus, it is abnormal. Nurses should remember: zygote reaches uterus by day 4, implantation occurs by day 6–7."
  },
  {
    "question_text": "Which sign indicates true labor?",
    "option_a": "Contractions that are irregular and painless",
    "option_b": "Contractions relieved by rest",
    "option_c": "Contractions associated with cervical dilation",
    "option_d": "Contractions confined to the lower abdomen",
    "correct_answer": "C",
    "explanation": "True labor is defined by regular painful contractions that lead to progressive cervical effacement and dilation. False labor involves irregular contractions that subside with rest and cause no cervical change.",
    "additional": "Exam trick: True labor = stronger, longer, closer contractions + cervical change. False labor = Braxton Hicks contractions (irregular, non-progressive, relieved by rest). Nurses should always assess cervix before confirming active labor."
  },
  {
    "question_text": "Which contraceptive method is contraindicated in women with history of thromboembolism?",
    "option_a": "Combined oral contraceptive pill",
    "option_b": "Copper intrauterine device",
    "option_c": "Progestin-only pill",
    "option_d": "Barrier methods",
    "correct_answer": "A",
    "explanation": "Estrogen-containing contraceptives increase the risk of venous thromboembolism and are contraindicated in women with history of DVT/PE, smokers above 35, and those with uncontrolled hypertension. Copper IUD and progestin-only methods are safe alternatives.",
    "additional": "Exam tip: Always think estrogen = clot risk. Nurses must screen clients for contraindications before prescribing OCPs. WHO medical eligibility criteria provide guidance on safe contraceptive use in various conditions."
  },
  {
    "question_text": "The hormone primarily responsible for uterine contractions during labor is:-",
    "option_a": "Progesterone",
    "option_b": "Oxytocin",
    "option_c": "Estrogen",
    "option_d": "Prolactin",
    "correct_answer": "B",
    "explanation": "Oxytocin is secreted by the posterior pituitary and stimulates uterine smooth muscle contraction during labor and milk ejection postpartum. Progesterone maintains pregnancy, estrogen enhances uterine sensitivity, and prolactin stimulates milk production.",
    "additional": "Exam focus: Oxytocin is used clinically for induction and augmentation of labor, and in management of postpartum hemorrhage. Nurses must monitor uterine contractions closely to prevent hyperstimulation and fetal distress."
  },
  {
    "question_text": "Which factor increases the risk of developing gestational diabetes?",
    "option_a": "History of macrosomic baby",
    "option_b": "First pregnancy",
    "option_c": "History of anemia",
    "option_d": "Low pre-pregnancy BMI",
    "correct_answer": "A",
    "explanation": "Women who previously delivered a macrosomic baby (>4 kg) are at higher risk of gestational diabetes in subsequent pregnancies. Other risk factors include obesity, advanced maternal age, family history of diabetes, and multiple pregnancies.",
    "additional": "High-yield: Gestational diabetes increases risk of macrosomia, neonatal hypoglycemia, shoulder dystocia, and future type 2 diabetes in mother. Nurses must ensure screening at 24–28 weeks using oral glucose tolerance test."
  },
  {
    "question_text": "Which complication is most associated with polyhydramnios?",
    "option_a": "Esophageal atresia",
    "option_b": "Renal agenesis",
    "option_c": "Intrauterine growth restriction",
    "option_d": "Placenta previa",
    "correct_answer": "A",
    "explanation": "Polyhydramnios (excessive amniotic fluid) is often due to fetal GI anomalies like esophageal atresia, which prevent normal swallowing and absorption of amniotic fluid. Renal agenesis is associated with oligohydramnios.",
    "additional": "Exam focus: Polyhydramnios risks include preterm labor, malpresentations, cord prolapse, and postpartum hemorrhage. Nurses must monitor maternal breathing difficulty and fundal height. Opposite condition, oligohydramnios, is associated with Potter sequence and pulmonary hypoplasia."
  },
  {
    "question_text": "Which of the following is the most common cause of early pregnancy bleeding?",
    "option_a": "Ectopic pregnancy",
    "option_b": "Threatened abortion",
    "option_c": "Placenta previa",
    "option_d": "Molar pregnancy",
    "correct_answer": "B",
    "explanation": "Threatened abortion is the most common cause of vaginal bleeding in the first trimester. It presents with vaginal spotting and closed cervical os. Ectopic pregnancy also causes early bleeding but is less common. Placenta previa causes bleeding in late pregnancy. Molar pregnancy is rare.",
    "additional": "High-yield: Early pregnancy bleeding differentials = threatened abortion, inevitable abortion, incomplete abortion, ectopic pregnancy, molar pregnancy. Nurses must assess hemodynamic stability, perform ultrasound, and provide reassurance or referral as indicated."
  },
  {
    "question_text": "Which factor predisposes a woman to uterine rupture during labor?",
    "option_a": "Previous cesarean section scar",
    "option_b": "Primigravida status",
    "option_c": "Twin pregnancy",
    "option_d": "Short stature",
    "correct_answer": "A",
    "explanation": "A previous cesarean section scar (especially classical incision) is the most significant risk factor for uterine rupture. Twin pregnancy or primigravida status alone does not cause rupture. Short stature predisposes to CPD but not directly to rupture.",
    "additional": "Exam tip: Uterine rupture is life-threatening, presenting with sudden cessation of contractions, abdominal pain, loss of fetal station, and fetal distress. Nurses must act rapidly: resuscitation, prepare for laparotomy, and support family."
  },
  {
    "question_text": "The most common cause of maternal mortality worldwide is:-",
    "option_a": "Postpartum hemorrhage",
    "option_b": "Sepsis",
    "option_c": "Eclampsia",
    "option_d": "Obstructed labor",
    "correct_answer": "A",
    "explanation": "Postpartum hemorrhage (PPH) is the leading cause of maternal mortality globally. Uterine atony is the main underlying cause. Sepsis, eclampsia, and obstructed labor also contribute significantly but are less common than PPH.",
    "additional": "Exam pearl: Remember the ‘Big Five’ causes of maternal death—PPH, sepsis, eclampsia, obstructed labor, unsafe abortion. Nurses are frontline in prevention: active management of third stage, infection control, early recognition of pre-eclampsia, skilled birth attendance."
  },
  {
    "question_text": "Which fetal presentation is associated with cord prolapse?",
    "option_a": "Vertex presentation",
    "option_b": "Breech presentation",
    "option_c": "Face presentation",
    "option_d": "Shoulder presentation",
    "correct_answer": "D",
    "explanation": "Cord prolapse occurs when the umbilical cord descends ahead of the presenting part. It is most associated with malpresentations such as transverse/shoulder presentation, breech with extended legs, or unengaged presenting parts.",
    "additional": "Key exam clue: Vertex engaged = low risk; malpresentations = high risk. Immediate nursing management: call for help, knee-chest position, elevate presenting part, cover cord with saline-soaked gauze, prepare for emergency CS."
  },
  {
    "question_text": "Which vitamin deficiency is most associated with neural tube defects?",
    "option_a": "Vitamin C",
    "option_b": "Folic acid",
    "option_c": "Vitamin D",
    "option_d": "Vitamin A",
    "correct_answer": "B",
    "explanation": "Folic acid deficiency before conception and in early pregnancy is strongly associated with neural tube defects like spina bifida and anencephaly. Vitamin C is for collagen synthesis, D for bone growth, A for epithelial health.",
    "additional": "Exam tip: WHO and NCK recommend folic acid supplementation (400 mcg/day) at least 1 month before conception and during the first trimester. Nurses must emphasize supplementation during health talks for women of reproductive age."
  },
  {
    "question_text": "Which of the following hormones maintains pregnancy until the placenta takes over?",
    "option_a": "hCG",
    "option_b": "Progesterone",
    "option_c": "Estrogen",
    "option_d": "Prolactin",
    "correct_answer": "A",
    "explanation": "Human chorionic gonadotropin (hCG), produced by trophoblasts, maintains the corpus luteum in early pregnancy, ensuring continued progesterone secretion until the placenta takes over around 12 weeks.",
    "additional": "High-yield: hCG is also the hormone detected in pregnancy tests. Abnormally high levels may indicate multiple gestation or molar pregnancy. Low or declining levels may suggest miscarriage or ectopic pregnancy."
  },
  {
    "question_text": "Which of the following is the first sign of puberty in girls?",
    "option_a": "Menarche",
    "option_b": "Thelarche",
    "option_c": "Pubarche",
    "option_d": "Growth spurt",
    "correct_answer": "B",
    "explanation": "Thelarche (breast budding) is the first sign of puberty in girls, followed by pubarche (pubic hair), growth spurt, and menarche. Menarche usually occurs 2–3 years after thelarche.",
    "additional": "Exam clue: Puberty sequence in girls = Thelarche → Pubarche → Growth spurt → Menarche. In boys, testicular enlargement is first. Nurses must recognize delayed or precocious puberty for timely referral."
  },
  {
    "question_text": "Which is the best position for a woman in labor with cord prolapse while awaiting cesarean section?",
    "option_a": "Lithotomy",
    "option_b": "Knee-chest position",
    "option_c": "Left lateral recumbent",
    "option_d": "Semi-sitting",
    "correct_answer": "B",
    "explanation": "Knee-chest or Trendelenburg position uses gravity to relieve pressure on the prolapsed cord. Lithotomy or sitting positions worsen compression. Left lateral helps with uteroplacental perfusion but not cord relief.",
    "additional": "Exam point: Along with position, nurses should manually elevate presenting part and cover exposed cord with warm saline-soaked gauze. Avoid handling cord excessively. Definitive management = emergency cesarean section."
  },
  {
    "question_text": "Which type of pelvis is most favorable for vaginal delivery?",
    "option_a": "Gynecoid",
    "option_b": "Android",
    "option_c": "Anthropoid",
    "option_d": "Platypelloid",
    "correct_answer": "A",
    "explanation": "The gynecoid pelvis has a rounded inlet and wide subpubic angle, making it most suitable for vaginal delivery. Android is heart-shaped and unfavorable. Anthropoid favors OP positions. Platypelloid is flat and associated with CPD.",
    "additional": "Exam hack: Gynecoid = good; Android = male-type; Anthropoid = long oval; Platypelloid = flat. Nurses should know pelvic types and their impact on labor progress."
  },
  {
    "question_text": "Which sign indicates placental separation?",
    "option_a": "Cessation of uterine contractions",
    "option_b": "Lengthening of the cord",
    "option_c": "Maternal hypotension",
    "option_d": "Decrease in vaginal bleeding",
    "correct_answer": "B",
    "explanation": "Signs of placental separation include lengthening of the cord, gush of blood, and a firm globular uterus rising in the abdomen. Hypotension is not a sign of separation but may indicate hemorrhage.",
    "additional": "NCK exam pearl: Nurses must always observe for separation signs before controlled cord traction. Pulling on an unseparated placenta can cause inversion or hemorrhage."
  },
  {
    "question_text": "Which of the following is the most common cause of infertility in women?",
    "option_a": "Tubal blockage",
    "option_b": "Endometriosis",
    "option_c": "Ovarian failure",
    "option_d": "Cervical stenosis",
    "correct_answer": "A",
    "explanation": "Tubal blockage, often due to pelvic inflammatory disease, is the leading cause of female infertility. Endometriosis and ovarian failure also contribute but are less common. Cervical stenosis is rare.",
    "additional": "Exam tip: Infertility causes in women = tubal (35–40%), ovarian (30–35%), uterine (10%), cervical (5%). Nurses play a role in prevention by promoting STI treatment and early PID management."
  },
  {
    "question_text": "Which of the following is the normal range of fetal heart rate?",
    "option_a": "80–100 bpm",
    "option_b": "100–120 bpm",
    "option_c": "120–160 bpm",
    "option_d": "160–200 bpm",
    "correct_answer": "C",
    "explanation": "The normal baseline fetal heart rate is 120–160 bpm. Bradycardia is <110 bpm, tachycardia is >160 bpm. Persistent abnormalities suggest fetal distress.",
    "additional": "Exam focus: Causes of fetal tachycardia = maternal fever, infection, fetal hypoxia. Causes of bradycardia = cord prolapse, maternal hypotension, prolonged decelerations. Nurses monitor FHR via intermittent auscultation or CTG."
  },
  {
    "question_text": "Which is the most effective method of preventing neonatal tetanus?",
    "option_a": "Sterile cord cutting",
    "option_b": "Neonatal tetanus immunization",
    "option_c": "Maternal tetanus immunization",
    "option_d": "Cord cleaning with antiseptics",
    "correct_answer": "C",
    "explanation": "The most effective prevention strategy is maternal immunization with tetanus toxoid, which provides passive immunity to the neonate. Cord hygiene is important but less effective alone.",
    "additional": "High-yield: WHO recommends at least 2 doses of tetanus toxoid in pregnancy. Nurses should educate mothers about antenatal immunization schedules as a cornerstone of maternal-child health."
  },
  {
    "question_text": "Which is the most common cause of neonatal sepsis?",
    "option_a": "Staphylococcus aureus",
    "option_b": "Escherichia coli",
    "option_c": "Group B Streptococcus",
    "option_d": "Klebsiella pneumoniae",
    "correct_answer": "C",
    "explanation": "Group B Streptococcus is the leading cause of early-onset neonatal sepsis. E. coli and Klebsiella also cause infections but are less common. S. aureus typically causes skin infections.",
    "additional": "Exam hack: Neonatal sepsis risk factors include PROM, maternal fever, prematurity, and chorioamnionitis. Nurses administer intrapartum antibiotic prophylaxis to GBS-positive mothers."
  },
  {
    "question_text": "Which of the following is a risk factor for placenta abruption?",
    "option_a": "Chronic hypertension",
    "option_b": "Rh incompatibility",
    "option_c": "Polyhydramnios",
    "option_d": "Multiple pregnancies",
    "correct_answer": "A",
    "explanation": "Chronic hypertension and pre-eclampsia are major risk factors for placental abruption. Rh incompatibility causes hemolytic disease, not abruption. Polyhydramnios and multiples increase risk of preterm labor, not abruption.",
    "additional": "Exam point: Placental abruption = painful vaginal bleeding, tender hard uterus, fetal distress. Nurses must monitor maternal vitals, provide IV fluids, oxygen, and prepare for urgent delivery."
  },
  {
    "question_text": "Which immunoglobulin is transferred across the placenta to provide passive immunity to the fetus?",
    "option_a": "IgA",
    "option_b": "IgG",
    "option_c": "IgM",
    "option_d": "IgE",
    "correct_answer": "B",
    "explanation": "IgG is the only immunoglobulin that crosses the placenta, providing passive immunity to the fetus. IgA is found in breast milk, IgM is first produced by fetus after infection, IgE is associated with allergies.",
    "additional": "Exam pearl: Newborn immunity comes from maternal IgG and breastfeeding (IgA). Nurses should stress exclusive breastfeeding for the first 6 months to optimize immune protection."
  },
  {
    "question_text": "Which is the earliest sign of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Morning sickness",
    "option_c": "Breast tenderness",
    "option_d": "Quickening",
    "correct_answer": "A",
    "explanation": "Amenorrhea (missed period) is usually the first sign of pregnancy. Morning sickness, breast changes, and quickening occur later. However, amenorrhea is presumptive and not diagnostic.",
    "additional": "Exam point: Presumptive signs = subjective (amenorrhea, nausea, breast changes). Probable signs = objective (positive test, enlarged uterus). Positive signs = confirmatory (fetal heart tones, ultrasound, examiner palpating movements)."
  },
  {
    "question_text": "Which antenatal finding strongly suggests pre-eclampsia?",
    "option_a": "Proteinuria and hypertension",
    "option_b": "Edema of lower limbs",
    "option_c": "Increased appetite",
    "option_d": "Nausea and vomiting",
    "correct_answer": "A",
    "explanation": "Pre-eclampsia is defined by hypertension after 20 weeks gestation with proteinuria and/or other systemic involvement. Edema is common in normal pregnancy and not diagnostic.",
    "additional": "Exam pearl: Severe features include BP ≥160/110, visual changes, headache, epigastric pain, thrombocytopenia, and elevated liver enzymes. Definitive treatment is delivery. Nurses monitor BP, urine protein, reflexes, and fetal well-being."
  },
  {
    "question_text": "Which drug is contraindicated in pregnancy?",
    "option_a": "Tetracycline",
    "option_b": "Penicillin",
    "option_c": "Erythromycin",
    "option_d": "Paracetamol",
    "correct_answer": "A",
    "explanation": "Tetracyclines are contraindicated in pregnancy because they cause permanent discoloration of fetal teeth and inhibit bone growth. Penicillin, erythromycin, and paracetamol are safe in pregnancy.",
    "additional": "NCK often tests teratogenic drugs: tetracyclines (teeth), aminoglycosides (ototoxicity), ACE inhibitors (renal dysgenesis), isotretinoin (craniofacial anomalies). Nurses should counsel mothers to avoid self-medication."
  },
  {
    "question_text": "Which is the main cause of maternal death in puerperium?",
    "option_a": "Sepsis",
    "option_b": "Thromboembolism",
    "option_c": "Hemorrhage",
    "option_d": "Hypertension",
    "correct_answer": "C",
    "explanation": "Postpartum hemorrhage is the leading cause of maternal death in the puerperium. Sepsis and thromboembolism are also important causes, but hemorrhage dominates worldwide statistics.",
    "additional": "Exam focus: Prevention of PPH through active management of third stage of labor is a global priority. Nurses administer oxytocin, massage uterus, and monitor lochia. Early detection and rapid resuscitation save lives."
  },
  {
    "question_text": "Which structure secretes progesterone in early pregnancy?",
    "option_a": "Corpus luteum",
    "option_b": "Placenta",
    "option_c": "Trophoblast",
    "option_d": "Ovary",
    "correct_answer": "A",
    "explanation": "In early pregnancy, the corpus luteum secretes progesterone, maintained by hCG, until the placenta takes over around 12 weeks. Placenta later becomes the main source.",
    "additional": "Exam pearl: Progesterone maintains uterine lining, reduces uterine contractility, and prepares breasts for lactation. Failure of corpus luteum support leads to early miscarriage."
  },
  {
    "question_text": "The hormone responsible for let-down reflex during breastfeeding is:-",
    "option_a": "Prolactin",
    "option_b": "Oxytocin",
    "option_c": "Estrogen",
    "option_d": "Progesterone",
    "correct_answer": "B",
    "explanation": "Oxytocin from the posterior pituitary causes milk ejection (let-down reflex). Prolactin stimulates milk production. Estrogen and progesterone prepare breast tissue during pregnancy.",
    "additional": "Exam tip: Stress and anxiety inhibit oxytocin release, reducing let-down reflex. Nurses should promote skin-to-skin contact, early initiation, and reassurance to enhance breastfeeding success."
  },
  {
    "question_text": "Which maternal factor increases risk of Down syndrome?",
    "option_a": "Advanced maternal age",
    "option_b": "Multiparity",
    "option_c": "Short stature",
    "option_d": "Multiple gestation",
    "correct_answer": "A",
    "explanation": "Advanced maternal age (≥35 years) increases risk of chromosomal abnormalities like Down syndrome. Multiparity and multiple gestation are not independent risk factors.",
    "additional": "Exam pearl: Screening options include first-trimester combined screening (NT scan + PAPP-A + β-hCG), and second-trimester quad screen. Definitive diagnosis requires amniocentesis or chorionic villus sampling."
  },
  {
    "question_text": "Which of the following is the best method to detect fetal well-being in labor?",
    "option_a": "Fetal movement count",
    "option_b": "Non-stress test",
    "option_c": "Cardiotocography",
    "option_d": "Ultrasound",
    "correct_answer": "C",
    "explanation": "Cardiotocography (continuous fetal heart rate monitoring with uterine contractions) is the best method for intrapartum assessment. NST is used antenatally, and ultrasound mainly for structural assessment.",
    "additional": "Exam focus: Nurses must differentiate between reactive NST, non-reactive NST, variable decelerations, late decelerations (uteroplacental insufficiency), and early decelerations (benign head compression)."
  },
  {
    "question_text": "Which of the following is the earliest sign of eclampsia?",
    "option_a": "Headache",
    "option_b": "Convulsions",
    "option_c": "Visual disturbances",
    "option_d": "Hypertension",
    "correct_answer": "A",
    "explanation": "Persistent severe headache is often the earliest warning sign of impending eclampsia. Convulsions occur later. Hypertension precedes eclampsia but is not an early warning symptom of seizure.",
    "additional": "Exam tip: Warning signs = headache, blurred vision, epigastric pain, hyperreflexia. Nurses should administer magnesium sulfate as prophylaxis, monitor vitals, and prepare for delivery."
  },
  {
    "question_text": "The most common cause of neonatal death globally is:-",
    "option_a": "Sepsis",
    "option_b": "Birth asphyxia",
    "option_c": "Prematurity and its complications",
    "option_d": "Congenital anomalies",
    "correct_answer": "C",
    "explanation": "Prematurity and its complications (respiratory distress, infections, hypothermia) are the leading causes of neonatal mortality worldwide. Sepsis and asphyxia follow closely.",
    "additional": "Exam point: Nurses play a key role in essential newborn care—thermal protection, infection prevention, early breastfeeding, and resuscitation skills. WHO’s Every Newborn Action Plan highlights prematurity as a priority."
  },
  {
    "question_text": "Which fetal presentation has the highest risk of obstructed labor?",
    "option_a": "Vertex",
    "option_b": "Breech",
    "option_c": "Face",
    "option_d": "Shoulder",
    "correct_answer": "D",
    "explanation": "Shoulder (transverse lie) presentation is most likely to cause obstructed labor because the presenting part cannot pass through the birth canal. Vertex is favorable, breech and face may be difficult but sometimes possible.",
    "additional": "Exam pearl: Malpresentations predispose to prolonged labor, rupture, cord prolapse, and cesarean delivery. Nurses must detect malpresentation early with Leopold’s maneuvers and refer promptly."
  },
  {
    "question_text": "Which investigation confirms pregnancy earliest?",
    "option_a": "Ultrasound",
    "option_b": "Urine pregnancy test",
    "option_c": "Abdominal palpation",
    "option_d": "Doppler fetal heart tones",
    "correct_answer": "A",
    "explanation": "Transvaginal ultrasound can confirm intrauterine pregnancy as early as 4–5 weeks. Urine pregnancy test confirms biochemically but not location. Doppler detects FHR at 10–12 weeks. Palpation is much later.",
    "additional": "Exam hack: NCK tests on ‘earliest’ vs ‘most reliable’ vs ‘most practical.’ Practical confirmation is urine test; earliest confirmation is ultrasound; most reliable sign is fetal heart activity seen/heard."
  },
  {
    "question_text": "Which maneuver is used to assess fetal lie and presentation?",
    "option_a": "McRoberts maneuver",
    "option_b": "Leopold’s maneuvers",
    "option_c": "Ritgen’s maneuver",
    "option_d": "Veit-Smellie maneuver",
    "correct_answer": "B",
    "explanation": "Leopold’s maneuvers involve systematic abdominal palpation to determine fetal lie, presentation, and engagement. McRoberts is used for shoulder dystocia, Ritgen’s for controlled head delivery, Veit-Smellie for breech.",
    "additional": "Exam pearl: Leopold’s four steps—fundal palpation, lateral palpation, pelvic palpation, and assessing descent. Nurses use this skill routinely in antenatal and labor wards."
  },
  {
    "question_text": "Which condition predisposes to polyhydramnios?",
    "option_a": "Esophageal atresia",
    "option_b": "Renal agenesis",
    "option_c": "Oligohydramnios",
    "option_d": "Placenta previa",
    "correct_answer": "A",
    "explanation": "Esophageal atresia prevents normal swallowing of amniotic fluid, leading to polyhydramnios. Renal agenesis causes oligohydramnios due to absent fetal urine. Placenta previa does not affect fluid volume.",
    "additional": "Exam tip: Polyhydramnios risks = preterm labor, malpresentations, cord prolapse, PPH. Nurses must monitor for maternal respiratory discomfort. Opposite condition oligohydramnios = Potter’s sequence (limb deformities, pulmonary hypoplasia)."
  },
  {
    "question_text": "Which type of twins results from fertilization of two ova by two sperm?",
    "option_a": "Monozygotic",
    "option_b": "Dizygotic",
    "option_c": "Conjoined",
    "option_d": "Identical",
    "correct_answer": "B",
    "explanation": "Dizygotic (fraternal) twins arise from fertilization of two separate ova by two sperm, leading to genetically different siblings. Monozygotic twins result from division of a single fertilized ovum.",
    "additional": "Exam pearl: Dizygotic twins always have two placentas and two amniotic sacs. Monozygotic twins may share placenta and/or amniotic sac depending on timing of zygote division. Conjoined twins = incomplete division."
  },
  {
    "question_text": "Which of the following is the best indicator of true labor?",
    "option_a": "Painful contractions",
    "option_b": "Bloody show",
    "option_c": "Cervical dilation",
    "option_d": "Backache",
    "correct_answer": "C",
    "explanation": "True labor is confirmed when contractions lead to progressive cervical dilation and effacement. Pain, bloody show, and backache may occur in false labor as well, but cervical change is diagnostic.",
    "additional": "Exam focus: Nurses must assess contractions (frequency, intensity, duration) and perform vaginal exam (if safe) to confirm cervical changes before diagnosing true labor."
  },
  {
    "question_text": "Which is the most common cause of first-trimester abortion?",
    "option_a": "Chromosomal abnormalities",
    "option_b": "Cervical incompetence",
    "option_c": "Maternal infections",
    "option_d": "Trauma",
    "correct_answer": "A",
    "explanation": "Most first-trimester spontaneous abortions are due to chromosomal abnormalities, especially trisomies. Cervical incompetence and infections are more common causes of second-trimester losses.",
    "additional": "Exam pearl: 50–70% of early miscarriages are chromosomal. Nurses must provide psychological support and counsel on recurrence risk, which is usually low unless multiple miscarriages occur."
  },
  {
    "question_text": "Which of the following is the main cause of anemia in pregnancy in developing countries?",
    "option_a": "Iron deficiency",
    "option_b": "Folic acid deficiency",
    "option_c": "Vitamin B12 deficiency",
    "option_d": "Chronic illness",
    "correct_answer": "A",
    "explanation": "Iron deficiency is the most common cause of anemia in pregnancy due to increased demand for maternal and fetal growth. Folic acid deficiency is also common but less frequent than iron deficiency.",
    "additional": "Exam focus: Anemia in pregnancy = Hb <11 g/dl. Complications: preterm birth, low birth weight, PPH risk. Nurses should emphasize iron-rich diet, supplementation, and deworming where hookworm is endemic."
  },
  {
    "question_text": "Which is the primary cause of maternal mortality due to unsafe abortion?",
    "option_a": "Hemorrhage",
    "option_b": "Infection",
    "option_c": "Uterine perforation",
    "option_d": "Embolism",
    "correct_answer": "B",
    "explanation": "Infection (septic abortion) is the leading cause of maternal death following unsafe abortion, especially in resource-limited settings. Hemorrhage and uterine perforation also contribute but are less common.",
    "additional": "Exam pearl: Post-abortion sepsis presents with fever, foul discharge, abdominal pain, septic shock. Nurses must provide emergency antibiotics, resuscitation, and counseling on contraception to prevent recurrence."
  },
  {
    "question_text": "Which of the following is the most important intervention to prevent postpartum hemorrhage?",
    "option_a": "Administration of oxytocin",
    "option_b": "Monitoring vital signs",
    "option_c": "Encouraging breastfeeding",
    "option_d": "Fundal massage only after hemorrhage occurs",
    "correct_answer": "A",
    "explanation": "Prophylactic administration of oxytocin immediately after delivery is the most effective way to prevent PPH by ensuring strong uterine contractions. Fundal massage helps but is not primary prevention.",
    "additional": "High-yield: Active management of third stage = oxytocin, controlled cord traction, uterine massage. Nurses must check completeness of placenta and membranes to prevent retained tissue PPH."
  },
  {
    "question_text": "Which condition is associated with oligohydramnios?",
    "option_a": "Renal agenesis",
    "option_b": "Esophageal atresia",
    "option_c": "Twin-to-twin transfusion",
    "option_d": "Polycythemia",
    "correct_answer": "A",
    "explanation": "Renal agenesis causes absent fetal urine output, resulting in oligohydramnios. Esophageal atresia causes polyhydramnios. Twin-to-twin transfusion leads to discordant fluid levels.",
    "additional": "Exam pearl: Oligohydramnios complications = Potter sequence (limb deformities, pulmonary hypoplasia), IUGR, cord compression. Nurses must monitor fetal growth and amniotic fluid index in antenatal care."
  },
  {
    "question_text": "Which of the following is the main purpose of antenatal care?",
    "option_a": "To provide curative treatment to mothers",
    "option_b": "To detect and prevent complications of pregnancy",
    "option_c": "To provide immunization services only",
    "option_d": "To prepare for cesarean section",
    "correct_answer": "B",
    "explanation": "The main purpose of antenatal care is to detect and prevent complications early, promote maternal and fetal health, and prepare for safe delivery. It is not just curative or limited to immunization.",
    "additional": "Exam focus: Components of ANC = history taking, physical exams, lab tests, supplementation, tetanus immunization, danger sign education, birth preparedness. Nurses are central in providing holistic ANC."
  },
  {
    "question_text": "Which is the most reliable sign of impending eclampsia?",
    "option_a": "Convulsions",
    "option_b": "Headache and visual disturbances",
    "option_c": "Proteinuria",
    "option_d": "Hypertension",
    "correct_answer": "B",
    "explanation": "Headache, visual changes, and epigastric pain are warning signs of impending eclampsia. Convulsions indicate eclampsia has already occurred. Proteinuria and hypertension are diagnostic but not predictive of seizures.",
    "additional": "Exam tip: Nurses should administer magnesium sulfate for seizure prophylaxis, monitor reflexes, and prepare for delivery once mother is stabilized."
  },
  {
    "question_text": "Which is the normal duration of pregnancy?",
    "option_a": "36 weeks",
    "option_b": "37–42 weeks",
    "option_c": "34–38 weeks",
    "option_d": "38–44 weeks",
    "correct_answer": "B",
    "explanation": "Normal term pregnancy ranges from 37 to 42 completed weeks. Before 37 weeks is preterm, and after 42 weeks is post-term.",
    "additional": "Exam pearl: Dating of pregnancy uses Naegele’s rule (LMP + 7 days – 3 months). Nurses should educate women on expected delivery window and importance of ANC follow-up near term."
  },
  {
    "question_text": "Which is the most common cause of puerperal sepsis?",
    "option_a": "Poor hand hygiene during delivery",
    "option_b": "Cesarean section wound infection",
    "option_c": "Urinary tract infection",
    "option_d": "Mastitis",
    "correct_answer": "A",
    "explanation": "Poor aseptic practices and poor hand hygiene during delivery are the main causes of puerperal sepsis. Cesarean wound infections and UTIs also contribute but are secondary.",
    "additional": "Exam tip: Prevention = hand hygiene, aseptic technique, limiting vaginal exams, prophylactic antibiotics for cesarean. Nurses are key in early detection of sepsis signs: fever, foul lochia, pelvic pain."
  },
  {
    "question_text": "Which of the following is the most common cause of infertility in men?",
    "option_a": "Varicocele",
    "option_b": "Obstructive azoospermia",
    "option_c": "Cryptorchidism",
    "option_d": "Erectile dysfunction",
    "correct_answer": "A",
    "explanation": "Varicocele, abnormal dilatation of pampiniform plexus veins, is the most common cause of male infertility as it impairs spermatogenesis. Obstruction and cryptorchidism are less common.",
    "additional": "Exam pearl: Causes of male infertility = varicocele, infections, obstruction, hormonal issues, erectile problems. Nurses should include men in infertility counseling and encourage lifestyle modification (avoid smoking, alcohol, heat exposure)."
  },
  {
    "question_text": "Which test is most commonly used for screening gestational diabetes?",
    "option_a": "Oral glucose tolerance test",
    "option_b": "Random blood glucose",
    "option_c": "Fasting blood glucose",
    "option_d": "HbA1c",
    "correct_answer": "A",
    "explanation": "The oral glucose tolerance test (OGTT) is the standard screening test for gestational diabetes, usually performed at 24–28 weeks. Random and fasting blood glucose are less sensitive.",
    "additional": "Exam focus: Risk factors for GDM = obesity, family history, advanced maternal age, previous macrosomic baby. Complications include macrosomia, neonatal hypoglycemia, shoulder dystocia, maternal diabetes later in life."
  },
  {
    "question_text": "Which is the best method to confirm intrauterine fetal death?",
    "option_a": "Absence of fetal heart tones on Doppler",
    "option_b": "Ultrasound showing absent cardiac activity",
    "option_c": "Absence of fetal movement",
    "option_d": "X-ray abdomen",
    "correct_answer": "B",
    "explanation": "Ultrasound showing absent fetal cardiac activity is the gold standard for confirming intrauterine fetal death. Absence of Doppler tones or fetal movement may suggest it but require confirmation.",
    "additional": "Exam pearl: Nurses must provide sensitive psychological support, explain options for induction, and prepare mother for emotional impact. Documentation and respectful care are critical."
  },
  {
    "question_text": "Which of the following is the main sign of obstructed labor?",
    "option_a": "Prolonged labor with Bandl’s ring",
    "option_b": "Rapid descent of presenting part",
    "option_c": "Short second stage of labor",
    "option_d": "Excessive bleeding in first stage",
    "correct_answer": "A",
    "explanation": "Obstructed labor presents with prolonged labor, Bandl’s ring (pathological retraction ring), maternal exhaustion, and fetal distress. Rapid descent is opposite, and early bleeding is unrelated.",
    "additional": "Exam tip: Causes include CPD, malpresentation, contracted pelvis. Complications: rupture, fistula, sepsis, death. Nurses must identify prolonged labor early and escalate care promptly."
  },
  {
    "question_text": "Which complication is most associated with breech delivery?",
    "option_a": "Cord prolapse",
    "option_b": "Shoulder dystocia",
    "option_c": "Placental abruption",
    "option_d": "Cephalhematoma",
    "correct_answer": "A",
    "explanation": "Cord prolapse is common in breech presentation, especially footling breech, because the presenting part does not fill the pelvis completely. Shoulder dystocia occurs in vertex macrosomia.",
    "additional": "Exam pearl: Breech deliveries risk cord prolapse, head entrapment, and birth trauma. Nurses must monitor closely in labor and prepare for possible cesarean."
  },
  {
    "question_text": "Which is the most common cause of maternal mortality in eclampsia?",
    "option_a": "Cerebral hemorrhage",
    "option_b": "Cardiac failure",
    "option_c": "Aspiration pneumonia",
    "option_d": "Renal failure",
    "correct_answer": "A",
    "explanation": "Cerebral hemorrhage and stroke due to severe hypertension are the leading causes of maternal death in eclampsia. Renal and cardiac complications occur but less frequently.",
    "additional": "Exam tip: Nurses must prioritize BP control, seizure prevention with magnesium sulfate, and airway protection to prevent aspiration. Definitive cure = delivery."
  },
  {
    "question_text": "Which is the best method of contraception immediately postpartum for breastfeeding mothers?",
    "option_a": "Combined oral contraceptive pill",
    "option_b": "Progestin-only pill",
    "option_c": "Copper intrauterine device",
    "option_d": "Barrier methods",
    "correct_answer": "B",
    "explanation": "Progestin-only pill (mini-pill) is safe during breastfeeding as it does not affect milk production. Combined OCPs contain estrogen, which reduces milk supply. IUDs can be used but often inserted at 6 weeks postpartum.",
    "additional": "Exam pearl: Lactational amenorrhea method (LAM) is effective for 6 months if mother exclusively breastfeeds and is amenorrheic. Nurses must counsel mothers on transition to another reliable method afterward."
  },
  {
    "question_text": "Which of the following is the best indicator of fetal maturity?",
    "option_a": "Fetal weight",
    "option_b": "Fetal length",
    "option_c": "Fetal lung maturity",
    "option_d": "Fetal movements",
    "correct_answer": "C",
    "explanation": "Fetal lung maturity, usually assessed by lecithin-sphingomyelin (L/S) ratio ≥2 in amniotic fluid, is the best indicator of maturity. Weight and length vary, and movements are not reliable.",
    "additional": "Exam pearl: Antenatal steroids (betamethasone) are given if risk of preterm delivery to accelerate lung maturity. Nurses monitor mothers for side effects and counsel on importance of steroids."
  },
  {
    "question_text": "Which condition is most associated with post-term pregnancy?",
    "option_a": "Macrosomia",
    "option_b": "Prematurity",
    "option_c": "Low birth weight",
    "option_d": "Neonatal jaundice",
    "correct_answer": "A",
    "explanation": "Post-term pregnancies often result in macrosomic babies (>4 kg), which increases risk of obstructed labor, shoulder dystocia, and cesarean delivery. Prematurity and low birth weight are opposite conditions.",
    "additional": "Exam pearl: Other complications of post-term pregnancy include oligohydramnios, meconium aspiration, and dysmaturity syndrome. Nurses must monitor fetal well-being and prepare for induction of labor."
  },
  {
    "question_text": "Which of the following is a complication of multiple pregnancy?",
    "option_a": "Polyhydramnios",
    "option_b": "Post-term pregnancy",
    "option_c": "Macrosomia",
    "option_d": "Decreased risk of preterm labor",
    "correct_answer": "A",
    "explanation": "Multiple pregnancies are associated with complications like polyhydramnios, preterm labor, preeclampsia, malpresentations, and postpartum hemorrhage. Post-term and macrosomia are less likely in twins.",
    "additional": "Exam tip: Nurses should monitor multiple gestations closely for anemia, hypertension, discordant growth, and preterm labor. Extra ANC visits are often required."
  },
  {
    "question_text": "Which is the commonest cause of primary postpartum hemorrhage?",
    "option_a": "Uterine atony",
    "option_b": "Retained placenta",
    "option_c": "Trauma to genital tract",
    "option_d": "Coagulopathy",
    "correct_answer": "A",
    "explanation": "Failure of the uterus to contract (uterine atony) after delivery is the main cause of primary PPH. Retained tissue, trauma, and coagulation defects are other causes but less common.",
    "additional": "Exam pearl: Remember the 4 Ts: Tone (atony), Tissue (retained placenta), Trauma (lacerations), Thrombin (clotting disorders). Nurses must act fast with uterine massage, oxytocin, IV fluids, and referral if bleeding persists."
  },
  {
    "question_text": "Which is the most important intervention for a woman with eclampsia immediately after a seizure?",
    "option_a": "Administer oxygen and maintain airway",
    "option_b": "Start IV fluids rapidly",
    "option_c": "Give antihypertensives immediately",
    "option_d": "Transfer the patient to theater",
    "correct_answer": "A",
    "explanation": "Post-seizure priorities are airway maintenance, oxygenation, and prevention of aspiration. IV fluids and antihypertensives follow stabilization. Delivery is the cure but not immediate priority after a convulsion.",
    "additional": "Exam tip: ABCs first. Nurses must position mother in left lateral, suction secretions, provide O2, and give magnesium sulfate. Antihypertensives (labetalol, hydralazine) follow once stabilized."
  },
  {
    "question_text": "Which sign is diagnostic of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Positive fetal heart tones",
    "option_c": "Breast tenderness",
    "option_d": "Nausea and vomiting",
    "correct_answer": "B",
    "explanation": "Only positive signs (fetal heart tones, ultrasound visualization, examiner palpating fetal movement) are diagnostic of pregnancy. Presumptive signs like amenorrhea, nausea, breast changes are suggestive but not diagnostic.",
    "additional": "Exam pearl: Nurses must differentiate presumptive vs probable vs positive signs in ANC teaching and exams. Fetal heart tones by Doppler confirm diagnosis from 10–12 weeks."
  },
  {
    "question_text": "Which of the following is the most common complication of preterm birth?",
    "option_a": "Respiratory distress syndrome",
    "option_b": "Hypoglycemia",
    "option_c": "Hypothermia",
    "option_d": "Sepsis",
    "correct_answer": "A",
    "explanation": "The lungs are immature in preterm infants, leading to respiratory distress syndrome due to deficiency of surfactant. Hypoglycemia, hypothermia, and sepsis are also risks but less common than RDS.",
    "additional": "Exam pearl: Nurses must prepare for neonatal resuscitation, provide thermal care, support breastfeeding, and monitor for hypoglycemia. Steroids given antenatally help prevent RDS."
  },
  {
    "question_text": "Which maternal complication is associated with polyhydramnios?",
    "option_a": "Placenta previa",
    "option_b": "Abruptio placentae",
    "option_c": "Uterine overdistension",
    "option_d": "Cervical incompetence",
    "correct_answer": "C",
    "explanation": "Polyhydramnios causes uterine overdistension, increasing risk of preterm labor, malpresentation, cord prolapse, and postpartum hemorrhage. Placenta previa and abruption are not directly linked.",
    "additional": "Exam focus: Nurses must monitor mothers for breathlessness, preterm contractions, and rapid fundal height increase. Ultrasound can assess fluid index and fetal anomalies causing polyhydramnios."
  },
  {
    "question_text": "Which hormone stimulates milk production after delivery?",
    "option_a": "Estrogen",
    "option_b": "Progesterone",
    "option_c": "Prolactin",
    "option_d": "Oxytocin",
    "correct_answer": "C",
    "explanation": "Prolactin, secreted by the anterior pituitary, stimulates milk production after delivery. Oxytocin causes milk ejection. Estrogen and progesterone prepare breast tissue during pregnancy.",
    "additional": "Exam pearl: Suckling stimulates prolactin release. Stress, fatigue, and infrequent breastfeeding reduce prolactin response. Nurses should encourage early and frequent breastfeeding."
  },
  {
    "question_text": "Which sign is suggestive of concealed placental abruption?",
    "option_a": "Painless vaginal bleeding",
    "option_b": "Tender, hard uterus without much bleeding",
    "option_c": "Soft relaxed uterus",
    "option_d": "Visible cord prolapse",
    "correct_answer": "B",
    "explanation": "Concealed abruption presents with a painful, tender, hard uterus but little or no vaginal bleeding because blood is trapped behind the placenta. Placenta previa causes painless bleeding. Cord prolapse has different presentation.",
    "additional": "Exam pearl: Concealed abruption can cause severe maternal shock with little external bleeding. Nurses should monitor for maternal collapse, fetal distress, and prepare for urgent delivery."
  },
  {
    "question_text": "Which of the following is the most common site of ectopic pregnancy?",
    "option_a": "Cervix",
    "option_b": "Ovary",
    "option_c": "Ampulla of fallopian tube",
    "option_d": "Abdominal cavity",
    "correct_answer": "C",
    "explanation": "The ampulla of the fallopian tube is the most common site of ectopic pregnancy (70%). Other sites like ovary, cervix, and abdomen are much rarer.",
    "additional": "Exam pearl: Risk factors = PID, tubal surgery, previous ectopic. Presentation = amenorrhea, abdominal pain, vaginal bleeding. Ruptured ectopic = shock. Nurses must act quickly for stabilization and referral."
  },
  {
    "question_text": "Which of the following is a common danger sign in the newborn?",
    "option_a": "Acrocyanosis",
    "option_b": "Generalized cyanosis",
    "option_c": "Mongolian spots",
    "option_d": "Transient murmurs",
    "correct_answer": "B",
    "explanation": "Generalized cyanosis indicates inadequate oxygenation and is a danger sign requiring immediate resuscitation. Acrocyanosis and transient murmurs are normal. Mongolian spots are benign skin pigmentation.",
    "additional": "Exam pearl: Danger signs in newborns include difficulty breathing, poor feeding, lethargy, hypothermia, seizures, jaundice in first 24 hrs. Nurses must educate mothers to seek immediate care."
  },
  {
    "question_text": "Which is the main purpose of using partograph in labor?",
    "option_a": "To predict fetal gender",
    "option_b": "To detect abnormal progress of labor",
    "option_c": "To confirm onset of labor",
    "option_d": "To record newborn weight",
    "correct_answer": "B",
    "explanation": "The partograph helps monitor maternal and fetal condition during labor, detect abnormal progress early, and guide timely interventions to prevent complications.",
    "additional": "Exam focus: Nurses plot cervical dilation against time, monitor descent, contractions, FHR, and maternal vitals. Crossing the alert line signals need for action. The partograph is a vital tool in safe motherhood."
  },
  {
    "question_text": "Which is the most common cause of neonatal jaundice in the first 24 hours?",
    "option_a": "Physiological jaundice",
    "option_b": "Rh incompatibility",
    "option_c": "Breast milk jaundice",
    "option_d": "Prematurity",
    "correct_answer": "B",
    "explanation": "Jaundice appearing in the first 24 hours is always pathological. Rh incompatibility (hemolytic disease of the newborn) is a common cause. Physiological jaundice occurs after 24–48 hrs. Breast milk jaundice appears later.",
    "additional": "Exam pearl: Nurses must check bilirubin levels, monitor for kernicterus, and prepare for phototherapy or exchange transfusion if levels are dangerously high."
  },
  {
    "question_text": "Which pelvic type is least favorable for vaginal delivery?",
    "option_a": "Gynecoid",
    "option_b": "Android",
    "option_c": "Anthropoid",
    "option_d": "Platypelloid",
    "correct_answer": "D",
    "explanation": "The platypelloid (flat) pelvis is least favorable because it has a narrow anteroposterior diameter, leading to CPD and obstructed labor. Gynecoid is most favorable.",
    "additional": "Exam pearl: Pelvic types often tested—Gynecoid (best), Android (male type, deep narrow), Anthropoid (long oval), Platypelloid (flat). Nurses should detect CPD early with partograph monitoring."
  },
  {
    "question_text": "Which of the following is the commonest cause of secondary postpartum hemorrhage?",
    "option_a": "Uterine atony",
    "option_b": "Retained placental tissue",
    "option_c": "Genital tract trauma",
    "option_d": "Coagulopathy",
    "correct_answer": "B",
    "explanation": "Secondary PPH (after 24 hrs up to 6 weeks) is most commonly due to retained placental tissue or subinvolution of uterus. Atony is main cause of primary PPH.",
    "additional": "Exam pearl: Nurses must teach mothers to report excessive bleeding, foul lochia, or fever postpartum. Management includes evacuation of retained tissue and antibiotics if infection is present."
  },
  {
    "question_text": "Which of the following is the most reliable method of confirming fetal maturity?",
    "option_a": "Amniotic fluid L/S ratio",
    "option_b": "Fundal height measurement",
    "option_c": "Gestational age by dates",
    "option_d": "Fetal movements",
    "correct_answer": "A",
    "explanation": "The lecithin-sphingomyelin (L/S) ratio in amniotic fluid ≥2:1 indicates fetal lung maturity, making it the most reliable test. Fundal height and movements are estimates, not confirmatory.",
    "additional": "Exam pearl: Nurses should remember antenatal steroids (betamethasone) accelerate lung maturity in preterm risk. Testing amniotic fluid helps guide timing of delivery in complicated pregnancies."
  },
  {
    "question_text": "Which of the following is the main complication of preterm premature rupture of membranes (PPROM)?",
    "option_a": "Chorioamnionitis",
    "option_b": "Placenta previa",
    "option_c": "Cord prolapse",
    "option_d": "Abruptio placentae",
    "correct_answer": "A",
    "explanation": "The main complication of PPROM is intrauterine infection (chorioamnionitis), due to prolonged exposure of membranes to ascending bacteria. Cord prolapse and abruption are possible but less frequent. Placenta previa is unrelated.",
    "additional": "Exam pearl: PPROM occurs before 37 weeks. Nurses should monitor maternal temperature, fetal heart rate, and liquor characteristics. Management includes hospitalization, antibiotics, steroids for lung maturity, and delivery if infection develops."
  },
  {
    "question_text": "Which of the following is the best method of assessing fetal growth?",
    "option_a": "Maternal weight gain",
    "option_b": "Fundal height measurement",
    "option_c": "Abdominal girth",
    "option_d": "Fetal movements",
    "correct_answer": "B",
    "explanation": "Fundal height in centimeters correlates with gestational age between 20–36 weeks and is the best clinical method for assessing fetal growth. Weight gain is maternal, not fetal. Abdominal girth is unreliable. Movements assess well-being, not growth.",
    "additional": "Exam focus: Intrauterine growth restriction (IUGR) is suspected if fundal height is less than dates. Excess growth may suggest macrosomia or polyhydramnios. Ultrasound biometry is the most accurate method."
  },
  {
    "question_text": "Which of the following is a contraindication to external cephalic version?",
    "option_a": "Polyhydramnios",
    "option_b": "Multiple pregnancy",
    "option_c": "Unengaged breech",
    "option_d": "Placenta previa",
    "correct_answer": "D",
    "explanation": "Placenta previa is an absolute contraindication to external cephalic version because manipulation risks hemorrhage. Polyhydramnios and unengaged breech are relative indications. Multiple pregnancy is also contraindicated but less absolute than previa.",
    "additional": "Exam pearl: ECV is done at 36–37 weeks for breech presentation if no contraindication. Nurses prepare mother, monitor FHR, and provide tocolysis if ordered. Risks: rupture, abruption, fetal distress."
  },
  {
    "question_text": "Which factor is most associated with shoulder dystocia?",
    "option_a": "Preterm labor",
    "option_b": "Macrosomia",
    "option_c": "Multiple pregnancy",
    "option_d": "Oligohydramnios",
    "correct_answer": "B",
    "explanation": "Shoulder dystocia occurs when the fetal shoulders fail to deliver after the head, most commonly due to macrosomia. Preterm babies are small and rarely cause it. Multiple gestation and oligohydramnios are less relevant.",
    "additional": "Exam focus: Risk factors = diabetes, obesity, post-term pregnancy, previous shoulder dystocia. Management includes McRoberts maneuver, suprapubic pressure, and avoiding fundal pressure. Complications: brachial plexus injury, hypoxia."
  },
  {
    "question_text": "Which is the most important intervention immediately after delivery of the placenta?",
    "option_a": "Administering oxytocin",
    "option_b": "Checking completeness of placenta and membranes",
    "option_c": "Recording maternal vital signs",
    "option_d": "Encouraging breastfeeding",
    "correct_answer": "B",
    "explanation": "Checking completeness of placenta and membranes ensures no retained tissue, which could cause hemorrhage or infection. Oxytocin is usually given before or at expulsion. Vital signs and breastfeeding follow.",
    "additional": "Exam pearl: Nurses must inspect for missing cotyledons or torn membranes. Retained fragments are a major cause of secondary PPH. Early detection prevents complications."
  },
  {
    "question_text": "Which of the following best describes the purpose of antenatal corticosteroids?",
    "option_a": "Reduce risk of congenital anomalies",
    "option_b": "Accelerate fetal lung maturity",
    "option_c": "Prevent preterm labor",
    "option_d": "Treat maternal infections",
    "correct_answer": "B",
    "explanation": "Antenatal steroids like betamethasone and dexamethasone are given to mothers at risk of preterm delivery to accelerate surfactant production and fetal lung maturity. They do not prevent labor or treat infections.",
    "additional": "Exam tip: Given between 24–34 weeks if delivery is imminent within 7 days. Nurses monitor mother for hyperglycemia and infection. Benefits: reduced risk of RDS, intraventricular hemorrhage, neonatal death."
  },
  {
    "question_text": "Which is the most common cause of maternal mortality in pre-eclampsia?",
    "option_a": "Pulmonary edema",
    "option_b": "Cerebral hemorrhage",
    "option_c": "Cardiac failure",
    "option_d": "Renal failure",
    "correct_answer": "B",
    "explanation": "Cerebral hemorrhage and stroke due to uncontrolled hypertension are the leading causes of maternal mortality in pre-eclampsia and eclampsia. Pulmonary edema and renal failure are also serious but less common.",
    "additional": "Exam pearl: Strict BP control with labetalol or hydralazine is essential. Nurses monitor neurological signs (headache, vision, reflexes) to detect impending complications early."
  },
  {
    "question_text": "Which test is most useful in detecting intrauterine growth restriction?",
    "option_a": "Maternal weight gain",
    "option_b": "Ultrasound biometry",
    "option_c": "Fetal movement count",
    "option_d": "Fundal height",
    "correct_answer": "B",
    "explanation": "Ultrasound biometry (BPD, AC, FL, EFW) is the most accurate method for diagnosing IUGR. Fundal height and maternal weight can suggest, but are not definitive. Fetal movement assesses well-being, not growth.",
    "additional": "Exam focus: Nurses must monitor high-risk mothers (hypertension, anemia, malnutrition) for IUGR. Serial ultrasounds are used to track growth, and early delivery may be needed if severe compromise occurs."
  },
  {
    "question_text": "Which is the best position for a pregnant woman with hypotension after lying supine?",
    "option_a": "Right lateral",
    "option_b": "Left lateral",
    "option_c": "Semi-sitting",
    "option_d": "Knee-chest",
    "correct_answer": "B",
    "explanation": "Supine hypotension syndrome occurs when the gravid uterus compresses the inferior vena cava. Left lateral position relieves compression and restores circulation. Right lateral may worsen it.",
    "additional": "Exam pearl: Nurses must advise pregnant women to avoid lying flat after mid-pregnancy. Symptoms: dizziness, pallor, hypotension, fetal distress. Management is simple repositioning."
  },
  {
    "question_text": "Which is the best indicator of progress in labor?",
    "option_a": "Cervical dilation",
    "option_b": "Strength of contractions",
    "option_c": "Descent of presenting part",
    "option_d": "Duration of contractions",
    "correct_answer": "A",
    "explanation": "Cervical dilation is the most reliable indicator of labor progress. Contractions and descent may occur without dilation. Nurses must check dilation via vaginal examination (when safe).",
    "additional": "Exam pearl: Active labor is diagnosed when cervix is ≥4 cm dilated with regular painful contractions. Partograph is used to monitor progress. Arrest disorders require intervention."
  },
  {
    "question_text": "Which of the following is the most common complication of placenta previa?",
    "option_a": "Painless vaginal bleeding",
    "option_b": "Severe abdominal pain",
    "option_c": "Hypertension",
    "option_d": "Oligohydramnios",
    "correct_answer": "A",
    "explanation": "Placenta previa typically presents with sudden, painless, bright red vaginal bleeding in the second or third trimester. Abdominal pain is more typical of placental abruption. Hypertension and oligohydramnios are unrelated.",
    "additional": "Exam pearl: Nurses must avoid vaginal exams in suspected placenta previa to prevent hemorrhage. Diagnosis is by ultrasound. Management depends on gestational age, bleeding severity, and maternal-fetal stability."
  },
  {
    "question_text": "Which is the most effective intervention to prevent neonatal hypothermia?",
    "option_a": "Immediate bathing after birth",
    "option_b": "Placing the baby in an incubator",
    "option_c": "Skin-to-skin contact with the mother",
    "option_d": "Keeping the baby under radiant warmer only",
    "correct_answer": "C",
    "explanation": "Immediate skin-to-skin contact (kangaroo mother care) is the most effective and natural way to prevent hypothermia by conserving heat through maternal body warmth. Bathing increases risk of heat loss.",
    "additional": "Exam pearl: Other thermal care measures include drying the baby, delayed bathing, room warming, and using hats/blankets. Hypothermia predisposes to hypoglycemia, sepsis, and respiratory distress."
  },
  {
    "question_text": "Which hormone is responsible for maintenance of pregnancy in the first trimester?",
    "option_a": "Progesterone from corpus luteum",
    "option_b": "Estrogen from placenta",
    "option_c": "Prolactin from pituitary",
    "option_d": "Oxytocin from posterior pituitary",
    "correct_answer": "A",
    "explanation": "During the first trimester, progesterone secreted by the corpus luteum maintains endometrial lining and pregnancy until the placenta takes over around 12 weeks. Estrogen rises later. Oxytocin and prolactin are not involved in early pregnancy maintenance.",
    "additional": "Exam pearl: hCG maintains corpus luteum function until placental progesterone secretion is sufficient. Without progesterone, miscarriage occurs."
  },
  {
    "question_text": "Which is the main purpose of giving Anti-D immunoglobulin?",
    "option_a": "To prevent neonatal jaundice",
    "option_b": "To prevent maternal isoimmunization",
    "option_c": "To increase maternal hemoglobin",
    "option_d": "To improve placental circulation",
    "correct_answer": "B",
    "explanation": "Anti-D immunoglobulin prevents Rh-negative mothers from developing antibodies against Rh-positive fetal blood, thus preventing hemolytic disease in future pregnancies. It does not treat maternal anemia or placental circulation.",
    "additional": "Exam pearl: Given within 72 hours of delivery, after abortion, ectopic pregnancy, or invasive procedures. Also given prophylactically at 28 weeks in Rh-negative mothers."
  },
  {
    "question_text": "Which of the following is the most common site of fertilization?",
    "option_a": "Infundibulum of fallopian tube",
    "option_b": "Ampulla of fallopian tube",
    "option_c": "Isthmus of fallopian tube",
    "option_d": "Uterine cavity",
    "correct_answer": "B",
    "explanation": "The ampullary region of the fallopian tube is the most common site of fertilization because it is the widest section allowing sperm-ovum interaction. Implantation occurs later in the uterus.",
    "additional": "Exam pearl: Abnormal implantation outside uterus = ectopic pregnancy, most often in the ampulla. Nurses must suspect ectopic in women with abdominal pain, bleeding, and positive pregnancy test."
  },
  {
    "question_text": "Which of the following is the most common cause of maternal death in the puerperium?",
    "option_a": "Sepsis",
    "option_b": "Thromboembolism",
    "option_c": "Postpartum hemorrhage",
    "option_d": "Hypertension",
    "correct_answer": "C",
    "explanation": "PPH remains the leading cause of maternal mortality in the puerperium, especially in low-resource settings. Sepsis and thromboembolism also contribute but are less frequent.",
    "additional": "Exam pearl: Prevention through active management of third stage, rapid recognition, and use of uterotonics is critical. Nurses play a key role in detecting early signs and initiating emergency measures."
  },
  {
    "question_text": "Which sign confirms ruptured membranes?",
    "option_a": "Bloody show",
    "option_b": "Pooling of amniotic fluid in vagina",
    "option_c": "Increased vaginal discharge",
    "option_d": "Presence of uterine contractions",
    "correct_answer": "B",
    "explanation": "Pooling of clear amniotic fluid in the vagina confirms rupture of membranes. Bloody show is mucus mixed with blood from cervix. Contractions do not confirm rupture.",
    "additional": "Exam pearl: Nitrazine paper and fern test can also confirm rupture. Prolonged rupture (>18 hrs) increases risk of chorioamnionitis. Nurses should monitor temperature, fetal heart, and liquor."
  },
  {
    "question_text": "Which of the following is the best method for estimating gestational age in the first trimester?",
    "option_a": "Fundal height",
    "option_b": "Last menstrual period",
    "option_c": "Crown-rump length on ultrasound",
    "option_d": "Quickening",
    "correct_answer": "C",
    "explanation": "Crown-rump length measurement on ultrasound is the most accurate method for dating pregnancy in the first trimester. LMP is useful but may be inaccurate if cycles are irregular.",
    "additional": "Exam pearl: In the second trimester, biparietal diameter and femur length are used. Fundal height is useful only after 20 weeks. Quickening varies between women."
  },
  {
    "question_text": "Which of the following is the earliest sign of puerperal infection?",
    "option_a": "Foul-smelling lochia",
    "option_b": "Maternal fever",
    "option_c": "Lower abdominal pain",
    "option_d": "Subinvolution of uterus",
    "correct_answer": "B",
    "explanation": "Maternal fever (temperature >38°C within 10 days postpartum) is usually the earliest sign of puerperal sepsis. Foul lochia, pain, and subinvolution follow later.",
    "additional": "Exam pearl: Nurses should monitor temperature and lochia in postpartum women. Prevention = hand hygiene, aseptic technique, prophylactic antibiotics for cesarean sections."
  },
  {
    "question_text": "Which is the best method of feeding a low birth weight infant when breastfeeding is not possible?",
    "option_a": "Bottle feeding",
    "option_b": "Cup and spoon feeding",
    "option_c": "Gavage feeding",
    "option_d": "IV fluids only",
    "correct_answer": "B",
    "explanation": "Cup and spoon feeding is recommended for low birth weight infants when direct breastfeeding is not possible. It reduces risk of nipple confusion and infection compared to bottles. Gavage is used only if baby cannot swallow.",
    "additional": "Exam pearl: Kangaroo mother care + cup feeding is the gold standard for LBW infants. Nurses should counsel mothers to avoid bottles due to high risk of contamination and diarrhea."
  },
  {
    "question_text": "Which of the following is the most common cause of neonatal conjunctivitis in the first 24 hours of life?",
    "option_a": "Chemical irritation from eye prophylaxis",
    "option_b": "Neisseria gonorrhoeae infection",
    "option_c": "Chlamydia trachomatis infection",
    "option_d": "Staphylococcus aureus infection",
    "correct_answer": "A",
    "explanation": "Chemical conjunctivitis from silver nitrate or prophylactic eye drops appears within the first 24 hours and resolves spontaneously. Gonococcal and chlamydial conjunctivitis appear later.",
    "additional": "Exam pearl: Nurses must differentiate by timing: 0–24h = chemical; 2–5d = gonococcal (severe, purulent); 5–14d = chlamydial. Prophylaxis with tetracycline or erythromycin ointment prevents neonatal ophthalmia."
  },
  {
    "question_text": "Which sign indicates retained placenta?",
    "option_a": "Excessive bleeding with soft uterus",
    "option_b": "Failure of placenta to deliver after 30 minutes",
    "option_c": "Firm uterus with no bleeding",
    "option_d": "Foul-smelling lochia",
    "correct_answer": "B",
    "explanation": "Retained placenta is diagnosed if the placenta fails to deliver within 30 minutes of the third stage of labor. Atony causes soft uterus with bleeding, not retention. Foul lochia indicates infection later.",
    "additional": "Exam pearl: Management includes manual removal under anesthesia. Nurses must monitor for hemorrhage and provide psychological support to the mother."
  },
  {
    "question_text": "Which of the following is the earliest sign of true labor?",
    "option_a": "Effacement and dilation of cervix",
    "option_b": "Backache",
    "option_c": "Bloody show",
    "option_d": "Painful contractions",
    "correct_answer": "A",
    "explanation": "The earliest diagnostic sign of true labor is cervical effacement and dilation. Painful contractions and bloody show may occur in false labor. Backache is nonspecific.",
    "additional": "Exam pearl: Nurses must confirm true labor by cervical changes, not just contraction patterns. Partograph helps in documenting progress objectively."
  },
  {
    "question_text": "Which of the following is a common complication of prolonged rupture of membranes?",
    "option_a": "Puerperal sepsis",
    "option_b": "Polyhydramnios",
    "option_c": "Gestational diabetes",
    "option_d": "Anemia in pregnancy",
    "correct_answer": "A",
    "explanation": "Prolonged rupture (>18 hours) predisposes to ascending infection, leading to chorioamnionitis and puerperal sepsis. Other listed options are unrelated.",
    "additional": "Exam pearl: Nurses should monitor maternal vitals, fetal heart, and liquor for signs of infection. Prophylactic antibiotics and timely delivery reduce risk."
  },
  {
    "question_text": "Which of the following is the most common cause of early pregnancy bleeding?",
    "option_a": "Ectopic pregnancy",
    "option_b": "Threatened abortion",
    "option_c": "Molar pregnancy",
    "option_d": "Placenta previa",
    "correct_answer": "B",
    "explanation": "Threatened abortion is the most common cause of bleeding before 20 weeks of pregnancy. It presents with vaginal bleeding, closed cervical os, and viable pregnancy. Ectopic and molar pregnancies are less common.",
    "additional": "Exam pearl: Early pregnancy bleeding always requires assessment with ultrasound, hCG levels, and maternal monitoring. Nurses must reassure and advise rest while monitoring for worsening symptoms."
  },
  {
    "question_text": "Which is the best position for the mother during the second stage of labor?",
    "option_a": "Supine with legs elevated",
    "option_b": "Lithotomy",
    "option_c": "Upright or squatting",
    "option_d": "Left lateral with legs extended",
    "correct_answer": "C",
    "explanation": "Upright or squatting positions during second stage of labor enhance uterine contractions, widen the pelvic outlet, and use gravity to aid fetal descent. Supine position increases risk of hypotension.",
    "additional": "Exam pearl: Nurses should encourage mobility and upright positions unless contraindicated. This shortens second stage, reduces assisted deliveries, and improves maternal satisfaction."
  },
  {
    "question_text": "Which condition is associated with excessive amniotic fluid?",
    "option_a": "Renal agenesis",
    "option_b": "Esophageal atresia",
    "option_c": "Placenta previa",
    "option_d": "Abruptio placentae",
    "correct_answer": "B",
    "explanation": "Esophageal atresia prevents swallowing of amniotic fluid by the fetus, leading to polyhydramnios. Renal agenesis is linked to oligohydramnios. Placenta previa and abruption do not cause fluid imbalance.",
    "additional": "Exam pearl: Nurses must monitor for maternal breathlessness, uterine overdistension, and risk of preterm labor in polyhydramnios. Management may include amnioreduction or delivery depending on severity."
  },
  {
    "question_text": "Which is the most reliable sign of fetal distress during labor?",
    "option_a": "Meconium-stained liquor",
    "option_b": "Persistent fetal bradycardia",
    "option_c": "Maternal tachycardia",
    "option_d": "Reduced fetal movements",
    "correct_answer": "B",
    "explanation": "Persistent fetal bradycardia (<110 bpm) is the most reliable sign of fetal distress. Meconium-stained liquor can occur without distress. Maternal tachycardia affects interpretation but is not a fetal sign.",
    "additional": "Exam pearl: Nurses monitor fetal heart by intermittent auscultation or CTG. Late decelerations and reduced variability also indicate distress and require urgent intervention."
  },
  {
    "question_text": "Which is the most important nursing action during cord prolapse?",
    "option_a": "Push presenting part off the cord and maintain pressure",
    "option_b": "Give oxygen to the mother",
    "option_c": "Insert urinary catheter",
    "option_d": "Prepare IV fluids",
    "correct_answer": "A",
    "explanation": "The priority is to relieve pressure on the cord by pushing the presenting part off and maintaining until delivery. Oxygen and IV fluids are supportive but not primary. Catheterization is irrelevant.",
    "additional": "Exam pearl: Immediate cesarean section is usually required. Nurses can also place the mother in knee-chest or Trendelenburg position to reduce cord compression until surgical intervention."
  },
  {
    "question_text": "Which of the following is the most common cause of infertility in women?",
    "option_a": "Endometriosis",
    "option_b": "Pelvic inflammatory disease",
    "option_c": "Polycystic ovarian syndrome",
    "option_d": "Tubal blockage",
    "correct_answer": "D",
    "explanation": "Tubal blockage, often due to PID and infections, is the most common cause of female infertility. Endometriosis and PCOS are also contributors but less frequent.",
    "additional": "Exam pearl: Nurses must educate women on STI prevention, prompt treatment, and early evaluation if unable to conceive. HSG and laparoscopy are diagnostic for tubal factors."
  },
  {
    "question_text": "Which of the following is the best indicator of fetal well-being?",
    "option_a": "Fetal movements",
    "option_b": "Fetal heart rate variability",
    "option_c": "Fundal height",
    "option_d": "Biophysical profile score",
    "correct_answer": "D",
    "explanation": "A biophysical profile (BPP) combines fetal breathing, movements, tone, amniotic fluid volume, and non-stress test, making it the best composite indicator of well-being. Variability and movements are important but partial indicators.",
    "additional": "Exam pearl: Nurses support BPP assessments and explain to mothers. A low score indicates hypoxia and may require immediate delivery."
  },
  {
    "question_text": "Which is the best management for shoulder dystocia?",
    "option_a": "Fundal pressure",
    "option_b": "McRoberts maneuver",
    "option_c": "Forceps delivery",
    "option_d": "Vacuum extraction",
    "correct_answer": "B",
    "explanation": "McRoberts maneuver (flexing maternal thighs onto abdomen) is the first-line management of shoulder dystocia. Fundal pressure worsens impaction. Forceps and vacuum are not helpful in this emergency.",
    "additional": "Exam pearl: Nurses assist with suprapubic pressure and prepare for neonatal resuscitation. Complications include brachial plexus injury and hypoxia if delivery is delayed."
  },
  {
    "question_text": "Which vitamin deficiency is associated with neural tube defects?",
    "option_a": "Vitamin A",
    "option_b": "Vitamin B12",
    "option_c": "Folic acid",
    "option_d": "Vitamin D",
    "correct_answer": "C",
    "explanation": "Folic acid deficiency is strongly linked to neural tube defects such as spina bifida and anencephaly. Supplementation before conception and in early pregnancy prevents these.",
    "additional": "Exam pearl: Nurses should emphasize folic acid supplementation (400 mcg daily for women of childbearing age). Higher doses are required in women with previous NTD-affected pregnancies."
  },
  {
    "question_text": "Which condition is most commonly associated with oligohydramnios?",
    "option_a": "Renal agenesis",
    "option_b": "Esophageal atresia",
    "option_c": "Placenta previa",
    "option_d": "Multiple pregnancy",
    "correct_answer": "A",
    "explanation": "Renal agenesis leads to oligohydramnios because the fetus is unable to produce urine, a major component of amniotic fluid. Esophageal atresia causes polyhydramnios.",
    "additional": "Exam pearl: Oligohydramnios is also seen in IUGR, post-term pregnancy, and ruptured membranes. Complications include pulmonary hypoplasia, deformities, and cord compression."
  },
  {
    "question_text": "Which of the following is the first sign of magnesium sulfate toxicity?",
    "option_a": "Absent patellar reflexes",
    "option_b": "Decreased respiratory rate",
    "option_c": "Cardiac arrest",
    "option_d": "Oliguria",
    "correct_answer": "A",
    "explanation": "Loss of deep tendon reflexes (patellar) is the earliest sign of magnesium toxicity. Respiratory depression and cardiac arrest occur later. Oliguria increases risk of toxicity but is not the first sign.",
    "additional": "Exam pearl: Nurses must monitor reflexes, respiratory rate, and urine output in mothers on MgSO₄. Calcium gluconate is the antidote and should be kept ready."
  },
  {
    "question_text": "Which drug is contraindicated in pregnancy due to teratogenicity?",
    "option_a": "Methotrexate",
    "option_b": "Ampicillin",
    "option_c": "Erythromycin",
    "option_d": "Paracetamol",
    "correct_answer": "A",
    "explanation": "Methotrexate is a folate antagonist and a known teratogen. It is contraindicated in pregnancy and sometimes used for medical termination of ectopic pregnancy. The other drugs are safe.",
    "additional": "Exam pearl: Nurses should always check drug safety in pregnancy. Other contraindicated drugs include ACE inhibitors, tetracyclines, and isotretinoin."
  },
  {
    "question_text": "Which is the commonest cause of maternal mortality worldwide?",
    "option_a": "Postpartum hemorrhage",
    "option_b": "Hypertensive disorders",
    "option_c": "Sepsis",
    "option_d": "Unsafe abortion",
    "correct_answer": "A",
    "explanation": "Postpartum hemorrhage remains the leading cause of maternal deaths globally, especially in low-resource settings. Hypertension and sepsis are also major contributors.",
    "additional": "Exam pearl: Active management of third stage of labor (AMTSL) is the most effective preventive intervention. Nurses are key in administering oxytocin, uterine massage, and rapid referral."
  },
  {
    "question_text": "Which is the most common presentation in cephalic deliveries?",
    "option_a": "Face",
    "option_b": "Brow",
    "option_c": "Vertex",
    "option_d": "Shoulder",
    "correct_answer": "C",
    "explanation": "Vertex presentation is the most common and favorable cephalic presentation. Face and brow are abnormal cephalic presentations. Shoulder is transverse lie.",
    "additional": "Exam pearl: Nurses should be able to identify fetal presentation via abdominal palpation and confirm with vaginal exam or ultrasound. Malpresentations often require cesarean delivery."
  },
  {
    "question_text": "Which is the best method to confirm rupture of membranes?",
    "option_a": "Observation of liquor leakage",
    "option_b": "Nitrazine paper test",
    "option_c": "Ultrasound scan",
    "option_d": "Palpation of uterus",
    "correct_answer": "B",
    "explanation": "The nitrazine test detects alkaline amniotic fluid turning paper blue, confirming rupture of membranes. Observation alone is not always reliable. Ultrasound may show reduced fluid but is less specific.",
    "additional": "Exam pearl: The fern test (microscopic crystallization pattern) is another confirmatory test. Prolonged rupture increases risk of infection, requiring close monitoring and sometimes antibiotics."
  },
  {
    "question_text": "Which of the following is the most common cause of stillbirth in developing countries?",
    "option_a": "Hypertensive disorders of pregnancy",
    "option_b": "Congenital anomalies",
    "option_c": "Cord accidents",
    "option_d": "Diabetes mellitus",
    "correct_answer": "A",
    "explanation": "Hypertensive disorders like pre-eclampsia and eclampsia are the leading causes of stillbirth in low-resource settings. In high-resource countries, congenital anomalies and cord accidents are more common.",
    "additional": "Exam pearl: Nurses must monitor BP, urine protein, and warning signs like headache, blurred vision, and epigastric pain in antenatal care to reduce risk."
  },
  {
    "question_text": "Which factor most predisposes to uterine rupture?",
    "option_a": "Previous cesarean section scar",
    "option_b": "Polyhydramnios",
    "option_c": "Multiple pregnancy",
    "option_d": "Grand multiparity",
    "correct_answer": "A",
    "explanation": "The most important risk factor for uterine rupture is a scar from a previous cesarean section. Polyhydramnios, multiple pregnancy, and grand multiparity increase risk but less strongly.",
    "additional": "Exam pearl: Nurses must recognize warning signs—sudden abdominal pain, loss of contractions, fetal distress, and shock. Immediate laparotomy is lifesaving."
  },
  {
    "question_text": "Which is the normal duration of the puerperium?",
    "option_a": "2 weeks",
    "option_b": "4 weeks",
    "option_c": "6 weeks",
    "option_d": "8 weeks",
    "correct_answer": "C",
    "explanation": "The puerperium is the 6-week period after delivery when maternal organs return to pre-pregnancy state. Most physiological changes are complete within this time.",
    "additional": "Exam pearl: Nurses should educate mothers on hygiene, lochia monitoring, danger signs, contraception, breastfeeding, and emotional support during puerperium."
  },
  {
    "question_text": "Which is the most important sign of fetal maturity?",
    "option_a": "Presence of lanugo",
    "option_b": "Presence of vernix caseosa",
    "option_c": "Presence of sole creases",
    "option_d": "Presence of Mongolian spots",
    "correct_answer": "C",
    "explanation": "Sole creases, especially extending to the heel, are a reliable sign of fetal maturity. Lanugo and vernix decrease with maturity. Mongolian spots are skin pigmentation, not maturity markers.",
    "additional": "Exam pearl: Other maturity indicators include firm ear cartilage, descended testes in males, and well-formed breast tissue. Nurses assess gestational age with scoring systems like Ballard."
  },
  {
    "question_text": "Which factor most predisposes to postpartum psychosis?",
    "option_a": "Multiple pregnancy",
    "option_b": "History of psychiatric illness",
    "option_c": "Cesarean section",
    "option_d": "Teenage pregnancy",
    "correct_answer": "B",
    "explanation": "Women with a history of psychiatric illness, especially bipolar disorder or schizophrenia, are at highest risk for postpartum psychosis. Obstetric factors are less predictive.",
    "additional": "Exam pearl: Postpartum psychosis is a psychiatric emergency with risk of harm to mother and baby. Nurses must ensure safety, rapid referral, and support family coping."
  },
  {
    "question_text": "Which is the most common cause of neonatal sepsis?",
    "option_a": "Group B Streptococcus",
    "option_b": "Escherichia coli",
    "option_c": "Staphylococcus aureus",
    "option_d": "Listeria monocytogenes",
    "correct_answer": "A",
    "explanation": "Group B Streptococcus is the leading cause of neonatal sepsis, especially early-onset disease. E. coli is second most common. S. aureus and Listeria are less frequent.",
    "additional": "Exam pearl: Nurses must recognize early signs—poor feeding, lethargy, temperature instability, respiratory distress. Prevention: intrapartum antibiotics for GBS-positive mothers."
  },
  {
    "question_text": "Which test best confirms diagnosis of gestational diabetes?",
    "option_a": "Fasting blood glucose",
    "option_b": "Random blood glucose",
    "option_c": "Oral glucose tolerance test",
    "option_d": "HbA1c",
    "correct_answer": "C",
    "explanation": "The oral glucose tolerance test (OGTT) is the gold standard for diagnosing gestational diabetes. Fasting or random tests are screening tools but not definitive.",
    "additional": "Exam pearl: Nurses play a role in preparing mothers for OGTT, explaining dietary requirements, and emphasizing the importance of follow-up care postpartum."
  },
  {
    "question_text": "Which condition is most associated with antepartum hemorrhage?",
    "option_a": "Placenta previa",
    "option_b": "Uterine rupture",
    "option_c": "Cord prolapse",
    "option_d": "Preeclampsia",
    "correct_answer": "A",
    "explanation": "Placenta previa is the leading cause of antepartum hemorrhage. It presents with painless, bright red bleeding. Uterine rupture causes intrapartum bleeding. Preeclampsia causes hypertension, not hemorrhage.",
    "additional": "Exam pearl: Nurses must differentiate placenta previa from placental abruption (painful bleeding). Management includes avoiding vaginal exams, monitoring, and preparing for cesarean if severe."
  },
  {
    "question_text": "Which is the best management for retained products of conception?",
    "option_a": "Expectant management",
    "option_b": "Administration of oxytocin",
    "option_c": "Manual evacuation of uterus",
    "option_d": "Blood transfusion",
    "correct_answer": "C",
    "explanation": "Manual evacuation of the uterus is the definitive treatment for retained products of conception. Oxytocin may help uterine contraction but will not expel retained tissue completely.",
    "additional": "Exam pearl: Nurses prepare the woman for evacuation, monitor for hemorrhage, give antibiotics, and provide psychological support. Complications include infection and infertility if untreated."
  },
  {
    "question_text": "Which vitamin deficiency is most associated with megaloblastic anemia in pregnancy?",
    "option_a": "Vitamin A",
    "option_b": "Folic acid",
    "option_c": "Vitamin D",
    "option_d": "Vitamin C",
    "correct_answer": "B",
    "explanation": "Folic acid deficiency is the leading cause of megaloblastic anemia in pregnancy due to increased demands. Vitamin B12 deficiency can also cause it but is less common.",
    "additional": "Exam pearl: Nurses must ensure pregnant women receive folic acid supplementation for anemia prevention and neural tube defect prevention. Iron and folate supplementation are standard ANC practice."
  },
  {
    "question_text": "Which is the earliest sign of pregnancy?",
    "option_a": "Amenorrhea",
    "option_b": "Nausea and vomiting",
    "option_c": "Breast changes",
    "option_d": "Quickening",
    "correct_answer": "A",
    "explanation": "Amenorrhea is usually the first symptom noticed by women and is the earliest presumptive sign of pregnancy. Other symptoms appear later.",
    "additional": "Exam pearl: Nurses must differentiate between presumptive (amenorrhea, nausea, breast changes), probable (Goodell’s, Chadwick’s, Hegar’s signs), and positive signs (FHTs, ultrasound)."
  },
  {
    "question_text": "Which is the most effective contraceptive for women immediately postpartum and breastfeeding?",
    "option_a": "Combined oral contraceptives",
    "option_b": "Progestin-only pills",
    "option_c": "Copper IUD",
    "option_d": "Condoms",
    "correct_answer": "B",
    "explanation": "Progestin-only pills (mini-pill) are safe during lactation and effective immediately postpartum. Combined OCPs suppress lactation and are avoided early postpartum.",
    "additional": "Exam pearl: Other safe postpartum methods include condoms, injectables, and implants. IUD can be inserted immediately postpartum if no infection risk."
  },
  {
    "question_text": "Which drug is given to accelerate fetal lung maturity in preterm labor?",
    "option_a": "Betamethasone",
    "option_b": "Oxytocin",
    "option_c": "Magnesium sulfate",
    "option_d": "Labetalol",
    "correct_answer": "A",
    "explanation": "Betamethasone (a corticosteroid) stimulates surfactant production and accelerates fetal lung maturity. Oxytocin induces labor, MgSO₄ prevents eclampsia, and labetalol treats hypertension.",
    "additional": "Exam pearl: Nurses must administer steroids between 24–34 weeks if preterm delivery is expected within 7 days. Monitor for maternal hyperglycemia and infection risk."
  },
  {
    "question_text": "Which sign best differentiates true labor from false labor?",
    "option_a": "Regular painful contractions with cervical changes",
    "option_b": "Backache relieved by rest",
    "option_c": "Contractions that disappear with walking",
    "option_d": "Irregular tightening without dilation",
    "correct_answer": "A",
    "explanation": "True labor is characterized by regular painful contractions accompanied by progressive cervical effacement and dilation. False labor contractions are irregular and relieved by activity or rest.",
    "additional": "Exam pearl: Nurses must confirm true labor before admission to labor ward. Partograph use starts once active labor is established (cervix ≥4 cm dilated)."
  }
]


